<template>
  <div class="main energy-tt">

    <section class="product">
      <h1 class="md-display-2">Твёрдотопливные котлы Энергия-ТТ</h1>
      <p class="md-body-2">
        Котельная на твёрдом топливе может использоваться даже там, куда не подведены ни газопровод, ни линия электропередач, - твердотопливные котлы полностью автономны. Это преимущество твердотопливных отопительных котлов в сочетании с невысокой стоимостью котла, а также доступностью и дешевизной топлива, обусловливает их популярность в России.
      </p>
    </section>

    <Energy-Template
      v-for="line in lines" :key="line.id"
      :Line="line" />

  </div>
</template>

<script>

  import EnergyTemplate from './EnergyTemplate.vue';

  export default {
    name: 'Energy-TT',

    components: { EnergyTemplate },

    data: () => ({
      lines: [

        {
          id: 'energy',
          title: 'Энергия-ТТ',
          image: null,
          images: [
            '/img/energy-tt/energy.jpg',
            '/img/energy-tt/energy-1.jpg',
            '/img/energy-tt/energy-2.jpg',
          ],
          price: null,
          characteristics: [
            'Применяется для обогрева жилых и административных зданий, производственных помещений;',
            'Горение топлива происходит в нижней части котла, оборудованной проточными колосниками;',
            'Загрузка топлива значительного объема позволяет обеспечить его горение в течение значительного периода (3-14 суток, в зависимости от теплопотерь здания, качества топлива и объема бункера котла);',
            'Загрузка топлива ручная, удаление шлака ручное;',
            'Топливо: антрацит, каменный уголь, бурый уголь, угольные брикеты, дрова;',
            'Длительность горения одной закладки: при максимальной мощности – 3-5 суток, средняя до 7 суток, в межсезонье до 14 суток;',
            'Тип тяги: естественная;',
            'Управление: электронное, контроллером управления работой наддува, насосами системы отопления;',
          ],
          docs: null,
          descriptions: [
            ''
          ],
          table: {
            head: [
              'Характеристики',
              'Мах мощность, кВт',
              'Отапливаемая площадь, м2',
              'КПД, %',
              'Габариты, мм (ДхШхВ)',
              'Диаметр дымохода, мм',
              'Объем воды в котле, л',
              'Масса котла нетто, кг',
              'Макc вес загружаемого угля, кг',
              'Макс. рабочее избыточное давление, бар',
              'Мин./макс. темп. на выходе из котла, °С',
              'Стоимость (без кожуха/с кожухом)',
            ],
            body: [
              [
                'Энергия ТТ 9 кВт',
                '9',
                'до 80',
                '70',
                '600х570х800',
                '150',
                '18',
                '80',
                '60',
                '2',
                '40/90',
                '49 000/59 000',
              ],
              [
                'Энергия ТТ 14 кВт',
                '14',
                'до 130',
                '70',
                '780х570х1350',
                '150',
                '27',
                '150',
                '100',
                '2',
                '40/90',
                '79 000/89 000',
              ],
              [
                'Энергия ТТ 18 кВт',
                '18',
                'до 180',
                '70',
                '990х700х1550',
                '150',
                '35',
                '190',
                '200',
                '2',
                '40/90',
                '89 000/101 000',
              ],
              [
                'Энергия ТТ 25 кВт',
                '25',
                'до 250',
                '70',
                '1400х770х1600',
                '150',
                '57',
                '290',
                '310',
                '2',
                '40/90',
                '99 000/112 000',
              ],
              [
                'Энергия ТТ 40 кВт',
                '40',
                'до 400',
                '70',
                '1000х770х1600',
                '150',
                '60',
                '320',
                '290',
                '2',
                '40/90',
                '109 000/122 000',
              ],
            ]
          }
        },

      ]
    }),

    computed: {
      toolbar () {
        return this.lines.map( ({ id , title }) => {
          return {
            id,
            title: title.includes('Kentatsu') ? title.slice(9) : title
          };
        });
      }
    },

    created () {
      this.$emit( 'set-toolbar' , this.toolbar );
    }
  };

</script>

<style lang="scss">

  .main.energy-tt {
    .md-card {
      overflow: hidden;
    }
    .md-table-head-container,
    .md-table-head-label {
      height: initial;
      overflow: unset;
      text-overflow: unset;
      white-space: unset;
    }
  }

</style>
