<template>
  <div class="main">

    <section class="product">
      <h1 class="md-display-2">Твёрдотопливные котлы НМК</h1>
      <p class="md-body-2">
        Котельная на твёрдом топливе может использоваться даже там, куда не подведены ни газопровод, ни линия электропередач, - твердотопливные котлы полностью автономны. Это преимущество твердотопливных отопительных котлов в сочетании с невысокой стоимостью котла, а также доступностью и дешевизной топлива, обусловливает их популярность в России
      </p>
    </section>

    <NMK-Template
      v-for="line in lines"
      :key="line.id"
      :Line="line" />

  </div>
</template>

<script>

  import NMKTemplate from './NMKTemplate.vue';

  export default {
    name: 'NMK',

    components: { NMKTemplate },

    data: () => ({
      lines: [

        {
          id: 'sibir',
          title: 'НМК Сибирь',
          image: null,
          images: [
            '/img/nmk/sibir.jpg',
            '/img/nmk/sibir-2.jpg'
          ],
          price: {
            value: 13300,
            currency: 'rub'
          },
          characteristics: [
            'Компактность. Габариты котла позволяют установить его в практически любые помещения;',
            'Экономичность. Специально разработанная конструкция котла позволяет максимально использовать тепловую энергию при сгорании топлива, при этом стальную плиту можно использовать для приготовления пищи и подогрева воды;',
            'Простота монтажа. Для повышения удобства монтажа котла и подключения его к системе отопления, котлы выпускаются в различных вариантах выхода дымохода и патрубков «подачи» и «обратки» воды;',
            'Совместимость с любой системой дымохода. Прямоугольное сечение дымохода удобно как при встраивании котла в кирпичную трубу, так и при переходе на круглую трубу типа «сэндвич» с использованием переходников с шибером;',
            'Удобство и простота в эксплуатации. Большие размеры дверки позволяют быстро загрузить и разжечь дрова. Через большие чугунные конфорки плиты можно загружать уголь из ведра. Большая топочная камера позволяет использовать дрова длиной до 50см;',
            'Долговечность. Бесперебойная работа котла гарантирована в течение десяти лет. Прочное полимерное покрытие защищает котел от ржавчины, царапин, легко моется в процессе эксплуатации. Запатентованная конструкция стальной плиты из 12 мм жаропрочной стали увеличивает срок ее службы до 10 лет в отличии от чугунного аналога;',
            'Технологичность. За счет внедрения водяного колосника достигнута максимальная теплоотдача носителю и увеличена скорость передачи тепла в систему.',
          ],
          docs: null,
          descriptions: null,
          table: '<colgroup> <col width="189"> <col width="107"> <col width="110"> <col width="110"> <col width="110"> <col width="110"> <col width="110"> </colgroup> <tbody> <tr height="40"> <td>Характеристики</td> <td>Ед. изм.</td> <td>КВО 8 кВт</td> <td>КВО 10 ТПЭ</td> <td>КВО 12 ТПЭ</td> <td>КВО 15 ТПЭ</td> <td>КВО 20 ТПЭ</td> </tr> <tr height="20"> <td>Номинальная мощность</td> <td>кВт</td> <td>8</td> <td>10</td> <td>12</td> <td>15</td> <td>20</td> </tr> <tr height="20"> <td>Отапливаемая площадь</td> <td>м2</td> <td>80</td> <td>100</td> <td>120</td> <td>150</td> <td>200</td> </tr> <tr height="20"> <td>Глубина топки</td> <td>мм</td> <td>400</td> <td>400</td> <td>600</td> <td>600</td> <td>600</td> </tr> <tr height="20"> <td>Рабочее давление</td> <td>мПа (кг/см&sup2;)</td> <td>0,1 (1)</td> <td>0,1 (1)</td> <td>0,1 (1)</td> <td>0,1 (1)</td> <td>0,1 (1)</td> </tr> <tr height="20"> <td>Объем водяного контура</td> <td>л</td> <td>&nbsp;</td> <td>33</td> <td>45</td> <td>46</td> <td>49</td> </tr> <tr height="20"> <td>&nbsp;</td> <td>&nbsp;</td> <td>&nbsp;</td> <td>55 х 245</td> <td>160 х 110</td> <td>55 х 245</td> <td>55 х 245</td> </tr> <tr height="20"> <td>Диаметр дымохода</td> <td>мм</td> <td>114</td> <td>150</td> <td>150</td> <td>150</td> <td>150</td> </tr> <tr height="20"> <td>Мощность блока ТЭНов</td> <td>кВт</td> <td>3</td> <td>3</td> <td>3</td> <td>3</td> <td>3</td> </tr> <tr height="20"> <td>Напряжение питания ТЭНов</td> <td>В</td> <td>220</td> <td>220</td> <td>220</td> <td>220</td> <td>220</td> </tr> <tr height="20"> <td colspan="7">Габаритные размеры котла</td> </tr> <tr height="20"> <td>глубина</td> <td>мм</td> <td>520</td> <td>520</td> <td>720</td> <td>720</td> <td>720</td> </tr> <tr height="20"> <td>ширина</td> <td>мм</td> <td>370</td> <td>420</td> <td>420</td> <td>420</td> <td>420</td> </tr> <tr height="20"> <td>высота</td> <td>мм</td> <td>550</td> <td>700</td> <td>700</td> <td>700</td> <td>700</td> </tr> <tr height="20"> <td>Масса котла</td> <td>кг</td> <td>63</td> <td>85</td> <td>100</td> <td>105</td> <td>110</td> </tr> <tr height="20"> <td colspan="2">Наличие стальной плиты</td> <td>+</td> <td>+</td> <td>+</td> <td>+</td> <td>+</td> </tr> <tr height="20"> <td colspan="2">Выход дымохода</td> <td>сверху</td> <td>сзади</td> <td>слева/справа</td> <td>сзади</td> <td>сзади</td> </tr> <tr height="20"> <td colspan="2">Расположение патрубков&nbsp;</td> <td>слева/справа</td> <td>слева/справа</td> <td>слева/справ</td> <td>слева/справа</td> <td>слева/справа</td> </tr> </tbody>'
        },

        {
          id: 'gefest',
          title: 'НМК Гефест',
          image: '/img/nmk/gefest.jpg',
          images: null,
          price: {
            value: 21570,
            currency: 'rub'
          },
          characteristics: [
            'Компактность. Габариты котла позволяют установить его в практически любые помещения;',
            'Экономичность. Специально разработанная конструкция котла позволяет максимально использовать тепловую энергию при сгорании топлива;',
            'Информативность. Температуру воды в котле показывает биметаллический термометр, встроенный в корпус;',
            'Использование блока ТЭНов. Возможность подключения блока ТЭНов с терморегулятором позволяет оставлять котел на долгое время, при этом он автоматически включится и будет поддерживать положительную температуру в системе отопления;',
            'Долговенность. Бесперебойная работа котла гарантирована в течение десяти лет;',
            'Технологичность. За счет внедрения водяного колосника достигнута максимальная теплоотдача носителю и увеличена скорость передачи тепла в систему. Также котел доработан и имеет автоматический регулятор тяги, который позволяет в автоматическом режиме поддерживать комфортную температуру теплоносителя. Данный котел подходит для закрытой системы отопления. В него добавлена дополнительная дверца в топочной камере, позволяющая сократить до минимума потери тепла;',
            'Презентабельный внешний вид. Визуально котел выглядит в духе времени, имеет приятное цветовое решение и стильный дизайн;',
            'Удобство в эксплуатации. Конструкция данного котла выполнена с максимально удобным расположением элементов, значительно улучшающая его эргономичность.',
          ],
          docs: null,
          descriptions: null,
          table: '<colgroup> <col width="223"> <col width="89"> <col width="123" span="3"> </colgroup> <tbody> <tr height="40"> <td>Параметр</td> <td>Ед.Изм</td> <td>15 ТЭ Gefest</td> <td>20 ТЭ Gefest</td> <td>30 ТЭ Gefest</td> </tr> <tr height="20"> <td>Теплопроизв.</td> <td>кВт</td> <td>15</td> <td>20</td> <td>30</td> </tr> <tr height="20"> <td>КПД, % (+3-5%)</td> <td>%</td> <td>75</td> <td>80</td> <td>80</td> </tr> <tr height="20"> <td>Рабочее давление воды</td> <td>МПа (кг/см2)</td> <td>0,2 (2)</td> <td>0,2 (2)</td> <td>0,2 (2)</td> </tr> <tr height="20"> <td>Отапливаемая площадь</td> <td>м2</td> <td>150</td> <td>200</td> <td>300</td> </tr> <tr height="20"> <td>Max t воды на выходе</td> <td>С</td> <td>85</td> <td>85</td> <td>85</td> </tr> <tr height="20"> <td>Nom температура воды на входе</td> <td>С</td> <td>60-80</td> <td>60-80</td> <td>60-80</td> </tr> <tr height="20"> <td>Объем водяного контура</td> <td>Л</td> <td>46</td> <td>50</td> <td>80</td> </tr> <tr height="20"> <td>Сечение дымохода</td> <td>мм</td> <td>55х245</td> <td>55х245</td> <td>55х245</td> </tr> <tr height="20"> <td>Мощность блока ТЭН</td> <td>кВт</td> <td>4</td> <td>4</td> <td>4</td> </tr> <tr height="20"> <td>Напряжение питания ТЭН</td> <td>В</td> <td>220</td> <td>220</td> <td>220</td> </tr> <tr height="20"> <td>Габаритные размеры</td> <td></td> <td></td> <td></td> </tr> <tr height="20"> <td>Глубина</td> <td>мм</td> <td>610</td> <td>610</td> <td>720</td> </tr> <tr height="20"> <td>Ширина</td> <td>мм</td> <td>410</td> <td>410</td> <td>460</td> </tr> <tr height="20"> <td>Высота</td> <td>мм</td> <td>740</td> <td>800</td> <td>940</td> </tr> <tr height="20"> <td>Глубина топочной камеры</td> <td>мм</td> <td>500</td> <td>500</td> <td>550</td> </tr> <tr height="20"> <td>Масса котла</td> <td>кг</td> <td>119</td> <td>129</td> <td>160</td> </tr> </tbody>'
        },

        {
          id: 'magnum',
          title: 'НМК Магнум',
          image: '/img/nmk/magnum.jpg',
          images: null,
          price: {
            value: 32700,
            currency: 'rub'
          },
          characteristics: [
            'Доступная цена: РРЦ завода НМК ниже рыночных аналогов на 30%;',
            'Удобство: в данном котле предусмотрен комфортный процесс удаления золы и отходов горения твердого топлива без остановки его деятельности;',
            'Инновационность: водонаполненный колосник, позволяющий увеличить скорость нагрева воды в системе и предотвращающий износ внутренних узлов котла;',
            'Экономичность: длительность бесперебойной работ при полной загрузке может составлять до 24 часов;',
            'Технологичность: в котле разработана уникальная система удаления крупной породы с использованием прочистных толкателей;',
            'Адаптивность: по собственному желанию данный котел можно оборудовать блоком ТЭНов с подключением пульта управления, что позволит поддерживать температуру в системе отопления в комфортном режиме в период межсезонья;',
            'Презентабельный внешний вид: данный котел, хоть и является пионером в своей линейке, но его выраженное сходство с фирменными цветами завода «НМК» делает его полноправным преемником заложенных традиций;',
            'Эргономичность: конструктивные элементы расположены таким образом, чтобы сделать процесс топки котла максимально удобным;',
            'Информативность: температуру воды в котле показывает биметаллический термометр, встроенный в корпус.',
          ],
          docs: null,
          descriptions: null,
          table: '<colgroup> <col width="427"> <col width="163" span="2"> </colgroup> <tbody> <tr height="20"> <td rowspan="3">Модель котла</td> <td>«Магнум»</td> <td>«Магнум»</td> </tr> <tr height="20"> <td rowspan="2">КДГ 15 ТЭ</td> <td rowspan="2">КДГ 20 ТЭ</td> </tr> <tr class="xl639128" style="height:15.0pt" height="20" valign="bottom"></tr> <tr height="20"> <td>Мощность котла, кВт</td> <td>15</td> <td>20</td> </tr> <tr height="20"> <td>КПД% (+3-5%)</td> <td>75</td> <td>80</td> </tr> <tr height="20"> <td>Рабочее давление воды в котле, МПа (кг/см2), не более</td> <td>0,2 (2)</td> <td>0,2 (2)</td> </tr> <tr height="20"> <td>Площадь отапливаемых помещений высотой до 2,7 м, м2</td> <td>50-120</td> <td>100-180</td> </tr> <tr height="20"> <td>Максимальная температура воды на выходе*, С</td> <td>85</td> <td>85</td> </tr> <tr height="20"> <td>Номинальная температура оборотной воды на входе в котёл, С</td> <td>45</td> <td>45</td> </tr> <tr height="20"> <td>Объем водяной камеры, л</td> <td>64</td> <td>77</td> </tr> <tr height="20"> <td>Объем загрузочной камеры, л</td> <td>30</td> <td>45</td> </tr> <tr height="20"> <td>Сечение дымохода , мм</td> <td>55*245</td> <td>55*245</td> </tr> <tr height="20"> <td>Диаметр дымохода, мм</td> <td>150</td> <td>150</td> </tr> <tr height="20"> <td>Возможность подключения ТЭНов</td> <td>Есть</td> <td>Есть</td> </tr> <tr height="20"> <td colspan="3">Габаритные размеры котла, мм</td> </tr> <tr height="20"> <td>Глубина</td> <td>640</td> <td>640</td> </tr> <tr height="20"> <td>Ширина</td> <td>455</td> <td>500</td> </tr> <tr height="20"> <td>Высота</td> <td>960</td> <td>1060</td> </tr> <tr height="60"> <td>Вид топлива</td> <td>антрацит, кам. уголь, угольн. брикеты, бурый уголь</td> <td>антрацит, кам. уголь, угольн. брикеты, бурый уголь</td> </tr> <tr height="20"> <td>Размер фракции угля, мм</td> <td>10-100</td> <td>10-100</td> </tr> <tr height="20"> <td>Масса котла, кг, не более</td> <td>160</td> <td>180</td> </tr> </tbody>'
        },

        {
          id: 'sunfire',
          title: 'НМК Sunfire',
          image: '/img/nmk/sunfire.jpg',
          images: null,
          price: {
            value: 62000,
            currency: 'rub'
          },
          characteristics: [
            'Более высокий КПД. По сравнению с линейкой котлов «Сибирь - Gefest» кпд вырос на 10%;',
            'Компактность. Габариты котла позволяют установить его в практически любые помещения;',
            'Экономичность. Специально разработанная конструкция котла позволяет максимально использовать тепловую энергию при сгорании топлива;',
            'Информативность. Температуру воды в котле показывает биметаллический термометр, встроенный в корпус;',
            'Долговечность. Бесперебойная работа котла гарантирована в течение десяти лет. Котел имеет высокопрочный корпус с антикоррозийной обработкой;',
            'Технологичность. Котел имеет автоматический регулятор тяги, который позволяет в автоматическом режиме поддерживать комфортную температуру теплоносителя. Данный котел подходит для закрытой системы отопления. В него добавлена дополнительная дверца в топочной камере, позволяющая загружать твердое топливо и очищать дымовые каналы от сажи;',
            'Презентабельный внешний вид. Визуально котел выглядит в духе времени, имеет приятное цветовое решение и стильный дизайн;',
            'Удобство в эксплуатации. Конструкция данного котла выполнена с максимально удобным расположением элементов, значительно улучшающая его эргономичность.',
          ],
          docs: null,
          descriptions: [
            '',
          ],
          table: '<colgroup> <col width="334"> <col width="124" span="3"> <col width="113"> </colgroup> <tbody> <tr height="45"> <td>Характеристики</td> <td>Ед.изм.</td> <td>Sunfire-45</td> <td>Sunfire-60</td> <td>Sunfire-75</td> </tr> <tr height="20"> <td>Теплопроизводительность</td> <td>кВт</td> <td>45</td> <td>60</td> <td>75</td> </tr> <tr height="20"> <td>КПД, % (+3-5%)</td> <td>%</td> <td>85</td> <td>85</td> <td>85</td> </tr> <tr height="20"> <td>Рабочее давление воды в котле не более</td> <td>МПа (кг/см2)</td> <td>0,2 (2)</td> <td>0,2 (2)</td> <td>0,2 (2)</td> </tr> <tr height="20"> <td>Максимальное давление воды в котле не более</td> <td>МПа (кг/см2)</td> <td>0,25</td> <td>0,25</td> <td>0,25</td> </tr> <tr height="20"> <td>Предохранительный клапан давления</td> <td>Бар</td> <td>2,5</td> <td>2,5</td> <td>2,5</td> </tr> <tr height="20"> <td>Отапливаемая площадь</td> <td>м2</td> <td>450</td> <td>550</td> <td>700</td> </tr> <tr height="20"> <td>Максимальная температура воды на выходе</td> <td>С</td> <td>85</td> <td>85</td> <td>85</td> </tr> <tr height="20"> <td>Номинальная температура воды на входе в котел</td> <td>С</td> <td>65-75</td> <td>65-75</td> <td>65-75</td> </tr> <tr height="20"> <td>Объем водяного контура</td> <td>Л</td> <td>180</td> <td>200</td> <td>230</td> </tr> <tr height="20"> <td>Диаметр дымохода</td> <td>мм</td> <td>200</td> <td>200</td> <td>200</td> </tr> <tr height="20"> <td>Температура продуктов сгорания</td> <td>С</td> <td>200</td> <td>200</td> <td>200</td> </tr> <tr height="20"> <td>Габаритные размеры котла</td> <td>&nbsp;</td> <td>&nbsp;</td> <td>&nbsp;</td> <td>&nbsp;</td> </tr> <tr height="20"> <td>Глубина</td> <td>мм</td> <td>1040</td> <td>1140</td> <td>1140</td> </tr> <tr height="20"> <td>Ширина</td> <td>мм</td> <td>615</td> <td>615</td> <td>715</td> </tr> <tr height="20"> <td>Высота</td> <td>мм</td> <td>1375</td> <td>1375</td> <td>1375</td> </tr> <tr height="20"> <td>Глубина топочной камеры</td> <td>мм</td> <td>590</td> <td>590</td> <td>590</td> </tr> <tr height="20"> <td>Масса котла</td> <td>кг</td> <td>340</td> <td>370</td> <td>435</td> </tr> </tbody>'
        }

      ]
    }),

    computed: {
      toolbar () {
        return this.lines.map( ({ id , title }) => ({ id , title }) );
      }
    },

    created () {
      this.$emit( 'set-toolbar' , this.toolbar );
    }

  };

</script>
