<template>
  <div class="main">

    <section class="product">
      <h1 class="md-display-2">Твёрдотопливные котлы Zota</h1>
      <p class="md-body-2">
        Котельная на твёрдом топливе может использоваться даже там, куда не подведены ни газопровод, ни линия электропередач, - твердотопливные котлы полностью автономны. Это преимущество твердотопливных отопительных котлов в сочетании с невысокой стоимостью котла, а также доступностью и дешевизной топлива, обусловливает их популярность в России.
      </p>
    </section>

    <Zota-Template
      v-for="line in lines"
      :key="line.id"
      :Line="line" />

  </div>
</template>

<script>

import ZotaTemplate from './ZotaTemplate.vue';

export default {
  name: 'Zota',
  components: { ZotaTemplate },
  data: () => ({
    lines: [

      {
        id: 'box',
        title: 'Zota Box',
        image: '/img/zota/box.jpg',
        images: [],
        price: null,
        characteristics: [
          'Поверхности внутреннего контура из высококачественной стали;',
          'верхняя загрузка топлива;',
          'удобная чистка теплообменника;',
          'высокая газоплотность;',
          'большое сечение загрузочного люка;',
          'наличие тягорегулятора и возможность регулировки третичного воздуха;',
          'трехходовой газоход;',
          'подвижная колосниковая решетка;',
          'специальная конструкция теплообменника с использованием шамота;',
          'возможность установки блок-ТЭНа мощностью от 3 до 9 кВт с пультом управления;',
          'наличие термоманометра с удобочитаемой шкалой на фронтальной части котла;',
          'рабочее давление 3 атм;',
          'регулируемый патрубок дымохода в комплекте;',
          'запирающаяся загрузочная дверца.'
        ],
        docs: null,
        descriptions: [
          'Котёл Zota Box предназначен для отопления жилых помещений. Применяется в системах отопления с принудительной циркуляцией и представлен в варианте мощностью 8 кВт.'
        ],
        table: {
          head: [
            'Тип',
            'Цена',
            'Мощность',
            'Объём водяной камеры',
            'Габаритные размеры',
            'Объём погрузочной камеры',
            'Диаметр дымохода',
            'Высота дымовой трубы',
            'Масса'
          ],
          body: [
            [
              'ZOTA «Box-8»',
              '16 890 руб.',
              '8 кВт',
              '18 л',
              '630x380x460 ',
              '26 л',
              '120 мм',
              '5 м',
              '71 кг'
            ]
          ]
        }
      },

      {
        id: 'carbon',
        title: 'Zota Carbon',
        image: '/img/zota/Carbon.jpg',
        images: [],
        price: {
          value: 2500,
          currency: 'rub'
        },
        characteristics: [
          'Поверхности внутреннего контура из высококачественной стали;',
          'верхняя загрузка топлива;',
          'удобная чистка теплообменника;',
          'высокая газоплотность;',
          'большое сечение загрузочного люка;',
          'наличие тягорегулятора и возможность регулировки третичного воздуха;',
          'трехходовой газоход;',
          'подвижная колосниковая решетка;',
          'специальная конструкция теплообменника с использованием шамота;',
          'возможность установки блок-ТЭНа мощностью от 3 до 9 кВт с пультом управления;',
          'наличие термоманометра с удобочитаемой шкалой на фронтальной части котла;',
          'рабочее давление 3 атм;',
          'регулируемый патрубок дымохода в комплекте;',
          'запирающаяся загрузочная дверца.'
        ],
        docs: null,
        descriptions: [
          'Стальной отопительный котел «Carbon», использующий в качестве топлива калиброванный уголь фракцией 10 - 50 мм, предназначен для отопления жилых и производственных помещений. Линейк изделий состоит из семи котлов мощностью от 15 о 60 киловатт.',
          'Главной особенностью этог котла является точная регулировка подаваемого в топку воздуха, обеспечивающая длительный процесс горения и поддерживающая максимальную чистоту теплообменных поверхностей.'
        ],
        table: {
          head: [
            'Тип',
            'Цена',
            'Мощность',
            'Объём водяной камеры',
            'Габаритные размеры',
            'Объём погрузочной камеры',
            'Диаметр дымохода',
            'Высота дымовой трубы',
            'Масса'
          ],
          body: [
            [
              'ZOTA «Сarbon-15»',
              '40 900 руб.',
              '15 кВт',
              '48 л',
              '760х465х970',
              '22 л',
              '150 мм',
              '6 м',
              '152 кг'
            ],
            [
              'ZOTA «Сarbon-20»',
              '46 700 руб.',
              '20 кВт',
              '55 л',
              '775х465х970',
              '30 л',
              '150 мм',
              '7 м',
              '176 кг'
            ],
            [
              'ZOTA «Сarbon-26»',
              '49 200 руб.',
              '26 кВт',
              '66 л',
              '905х465х1090',
              '40 л',
              '150 мм',
              '8 м',
              '196 кг'
            ],
            [
              'ZOTA «Сarbon-32»',
              '54 900 руб.',
              '32 кВт',
              '78 л',
              '905х580х1090',
              '58 л',
              '150 мм',
              '9 м',
              '240 кг'
            ],
            [
              'ZOTA «Сarbon-40»',
              '66 900 руб.',
              '40 кВт',
              '93 л',
              '910х695х1090',
              '76 л',
              '180 мм',
              '11 м',
              '284 кг'
            ],
            [
              'ZOTA «Сarbon-50»',
              '73 500 руб.',
              '50 кВт',
              '102 л',
              '915х695х1170',
              '87 л',
              '180 мм',
              '13 м',
              '303 кг'
            ],
            [
              'ZOTA «Сarbon-60»',
              '86 900 руб.',
              '60 кВт',
              '121 л',
              '915х815х1190',
              '110 л',
              '180 мм',
              '15 м',
              '375 кг'
            ]
          ]
        }
      },

      {
        id: 'master',
        title: 'Zota Master',
        image: '/img/zota/master.jpg',
        images: [],
        price: null,
        characteristics: [
          'Высокая степень теплоизоляции и газоплотности, теплообменник комбинированного типа;',
          'Корпус котла под декоративной обшивкой изолирован базальтовым картоном;',
          'Комбинированный теплообменник, состоящий из трубного отсека;',
          'Предусмотрена установка механического тягорегулятора;',
          'Камера сгорания рассчитана под эффективное сгорание угля и прекрасно подходит под использование дров. В самый большой по мощности котел можно укладывать дрова длиной до 70 см. А модель «Master-20» подходит для установки газовой горелки, что делает ее наиболее универсальной. Все котлы могут быть укомплектованы блок-ТЭНом мощностью до 9 кВт;',
          'Применение блок-ТЭНа в комбинации с пультом управления позволяет сгладить температурные провалы и сделать процесс отопления более комфортным.',
          'Возможность дополнительной установки комплекта ТЭНБ 2"'
        ],
        docs: [
          '//zota.ru/static/uploaded/documentation/entries/files/Pasport_Zota_Master_12-32.pdf'
        ],
        descriptions: [
          'Котёл отопительный твердотопливный «Мaster» это модель в ряду твердотопливных стальных котлов «ZOTA». Данная модель была создана как некая параллель котла «Дымок»: доступный, массовый, простой, но технологически более продвинутый и современный. Котлы «Master» созданы для работы в автономных отопительных системах с рабочим давлением до 3 атмосфер и могут использоваться для отопления жилых и производственных помещений. Линейка состоит из пяти котлов от 12 до 32 кВт. Все модели снабжены варочной поверхностью со съемной конфоркой, кроме модели «Master-20».'
        ],
        table: {
          head: [
            'Тип',
            'Цена',
            'Мощность',
            'Объём водяной камеры',
            'Габаритные размеры',
            'Объём погрузочной камеры',
            'Диаметр дымохода',
            'Высота дымовой трубы',
            'Масса'
          ],
          body: [
            [
              'ZOTA «Master-12»',
              '24 390 руб.',
              '12 кВт',
              '33 л',
              '720х440х670',
              '32 л',
              '150 мм',
              '5 м',
              '105 кг'
            ],
            [
              'ZOTA «Master-14»',
              '23 990 руб.',
              '14 кВт',
              '40 л',
              '720х440х720',
              '32 л',
              '150 мм',
              '5 м',
              '103 кг'
            ],
            [
              'ZOTA «Master-18»',
              '28 390 руб.',
              '18 кВт',
              '45 л',
              '820х440х720',
              '38 л',
              '150 мм',
              '5 м',
              '126 кг'
            ],
            [
              'ZOTA «Master-20»',
              '27 790 руб.',
              '20 кВт',
              '53 л',
              '820х440х760',
              '40 л',
              '150 мм',
              '5 м',
              '128 кг'
            ],
            [
              'ZOTA «Master-25»',
              '32 590 руб.',
              '25 кВт',
              '56 л',
              '900х500х720',
              '52 л',
              '150 мм',
              '6 м',
              '154 кг'
            ],
            [
              'ZOTA «Master-32»',
              '36 590 руб.',
              '32 кВт',
              '62 л',
              '1000х500х720',
              '61 л',
              '150 мм',
              '7 м',
              '174 кг'
            ]
          ]
        }
      },

      {
        id: 'mix',
        title: 'Zota Mix',
        image: '/img/zota/mix.jpg',
        images: [],
        price: null,
        characteristics: [
          'Х-образная конструкция теплообменника позволяет добиться максимально возможной площади теплообмена, а следовательно достичь наилучшей теплоотдачи и повысить КПД котла;',
          'Благодаря качеству примененной высокоэффективной теплоизоляции снижаются теплопотери, повышается теплоотдача, котел становится более пожаробезопасным;',
          'Внешний кожух котла, закрывающий дополнительный слой теплоизоляции, покрыт специальной порошковой краской повышенной износоустойчивости;',
          'Для удобства чистки котла за передней панелью предусмотрена съемная дверца, открывающая удобный доступ к газоходу. Для удаления остаточных продуктов горения без лишних неудобств - большой зольный ящик, расположенный за дверцей зольника. Возможность дополнительной установки комплекта ТЭНБ 2"'
        ],
        docs: [
          '//zota.ru/static/uploaded/documentation/entries/files/Pasport_ZOTA_Mix_20-50.pdf'
        ],
        descriptions: [
          'Отопительные котлы ZOTA «Mix» это линейка из четырех стальных твердотопливных комбинированных котлов мощностью 20; 31,5; 40 и 50 кВт. Основной конструктивной особенностью котла является возможность совмещения отопления твердым топливом (уголь, дрова, топливные брикеты), природным или сжиженным газом, жидким топливом и электричеством. Во всех модификациях предусмотрена возможность установки блоков ТЭН мощностью от 3 до 9 кВт, работающих под контролем внешнего электронного модуля (пульта) управления.'
        ],
        table: {
          head: [
            'Тип',
            'Цена',
            'Мощность',
            'Объём водяной камеры',
            'Габаритные размеры',
            'Объём погрузочной камеры',
            'Диаметр дымохода',
            'Высота дымовой трубы',
            'Масса'
          ],
          body: [
            [
              'ZOTA «Mix-20»',
              '36 900 руб.',
              '20 кВт',
              '50 л',
              '580x425x1060',
              '35 л',
              '150 мм',
              '6 м',
              '135 кг'
            ],
            [
              'ZOTA «Mix-31,5»',
              '40 900 руб.',
              '31,5 кВт',
              '70 л',
              '680x430x1060',
              '45 л',
              '150 мм',
              '7 м',
              '154 кг'
            ],
            [
              'ZOTA «Mix-40»',
              '53 900 руб.',
              '40 кВт',
              '120 л',
              '685x480x1170',
              '63 л',
              '180 мм',
              '8 м',
              '184 кг'
            ],
            [
              'ZOTA «Mix-50»',
              '58 900 руб.',
              '50 кВт',
              '140 л',
              '785x480x1170',
              '79 л',
              '180 мм',
              '9 м',
              '207 кг'
            ],
          ]
        }
      },

      {
        id: 'pellet',
        title: 'Zota Pellet',
        image: '/img/zota/pellet.jpg',
        images: [],
        price: null,
        characteristics: [
          'Высокая степень автоматизации процесса отопления;',
          'Экологичность и чистота;',
          'Автоматика для поддержания установленной температуры теплоносителя;',
          'Система безопасности от перегрева и проникновения;',
          'Применение двушнековой подачи обеспечивает пассивную пожаробезопасность.',
          'При достижении установленной температуры котёл входит в режим ожидания.',
          'Система автоматического розжига;',
          'Хронотермостат и программа погодозависимого управления;',
          '«GSM»-модуль даёт возможность контролировать процесс отопления дистанционно , устанавливаемый опционально на любую модель пеллетных котлов.'
        ],
        docs: null,
        descriptions: [
          'Линейка котлов под маркой ZOTA «Pellet» состоит из пяти моделей мощностью 15, 25, 40, 63 и 100 кВт. Топливом служит продукция переработки древесины – изготовленные путём прессования без связывающих добавок древесные опилки хвойных и лиственных пород – пеллеты.',
          'Пеллетные котлы ZOTA «Pellet» с водяным контуром охлаждения и шнековым механизмом подачи топлива предназначены для теплоснабжения зданий, оборудованных системой водяного отопления с принудительной циркуляцией.',
          'Котёл работает в системах с давлением теплоносителя 3 атмосферы, а высокая газоплотность и точность контроля и изменения объёма подаваемого в топку воздуха дают возможность уменьшать мощность котла до 50% от номинала.'
        ],
        table: {
          head: [
            'Тип',
            'Цена',
            'Мощность',
            'Объём водяной камеры',
            'Габаритные размеры',
            'Объём погрузочной камеры',
            'Диаметр дымохода',
            'Высота дымовой трубы',
            'Масса'
          ],
          body: [
            [
              'ZOTA «Pellet»-15S',
              '162 000 руб.',
              '15 кВт',
              '96 л',
              '1060х1140х1570',
              '150 мм',
              '6 м',
              '333 кг',
              '318'
            ],
            [
              'ZOTA "Pellet"-20S',
              '179 000 руб.',
              '20 кВт',
              '93 л',
              '1060х1140х1570',
              '150 мм',
              '7 м',
              '340 кг',
              '--'
            ],
            [
              'ZOTA «Pellet»-25А',
              '196 000 руб.',
              '25 кВт',
              '84 л',
              '1060х1230х1415',
              '150 мм',
              '6 м',
              '357 кг',
              '357'
            ],
            [
              'ZOTA «Pellet»-40А',
              '227 000 руб.',
              '40 кВт',
              '130 л',
              '1220х1280х1530',
              '180 мм',
              '7 м',
              '490 кг',
              '490'
            ],
            [
              'ZOTA «Pellet»-63А',
              '319 000 руб.',
              '63 кВт',
              '214 л',
              '1405х1500х1590',
              '180 мм',
              '9 м',
              '677 кг',
              '677'
            ],
            [
              'ZOTA «Pellet»-100А',
              '379 000 руб.',
              '100 кВт',
              '277 л',
              '1525х1500х1685',
              '180 мм',
              '12 м',
              '829 кг',
              '829'
            ],
          ]
        }
      },

      {
        id: 'stakhanov',
        title: 'Zota Стаханов',
        image: '/img/zota/stakhanov.jpg',
        images: [],
        price: null,
        characteristics: [
          'Автоматическая подача топлива;',
          'В систему автоматики включен хронотермостат, позволяющий задать изменение температурных режимов в зависимости от времени суток и дня недели.',
          'Пониженная мощность энергопотребления (260 Вт), что снижает стоимость дополнительного оборудования (источника бесперебойного питания);',
          'работа в закрытых отопительных системах с давлением до 3 атмосфер;',
          'герметичный бункер;',
          'возможность установки блок-ТЭНа мощностью от 3 до 15 кВт с автоматикой (в зависимости от мощности котла);',
          'возможность использования дров в качестве резервного топлива (работа в ручном режиме; колосники в комплекте)',
          'лицензионный Windows CE;',
          'ЖК-экран;',
          'погодозависимое управление.'
        ],
        docs: null,
        descriptions: [
          'Основным преимуществом котлов с автоматической подачей топлива является возможность организации процесса отопления с длительным сроком горения (до семи суток) без добавления топлива. (Длительность горения зависит от теплопотерь помещения, установок котла и калорийности угля)',
          'Линейка котлов «Стаханов» состоит из пяти изделий мощностью 15, 25, 40, 63 и 100 кВт и предназначена для автономных отопительных систем жилых и производственных помещений площадью до 1000 м2. Котел-использует в качестве топлива неспекающиеся сорта угля с фракцией до 50 мм. Альтернативой в качестве основного топлива могут служить пеллеты.'
        ],
        table: {
          head: [
            'Тип',
            'Цена',
            'Мощность',
            'Объём водяной камеры',
            'Габаритные размеры',
            'Объём погрузочной камеры',
            'Диаметр дымохода',
            'Высота дымовой трубы',
            'Масса'
          ],
          body: [
            [
              '«Стаханов»-15',
              '197 000 руб.',
              '15 кВт',
              '65 л',
              '1040х1605х1650',
              '150 мм',
              '5 м',
              '400 кг',
              '30 кг'
            ],
            [
              '«Стаханов»-25',
              '218 000 руб.',
              '25 кВт',
              '84 л',
              '1065х1605х1660',
              '150 мм',
              '6 м',
              '430 кг',
              '49 кг'
            ],
            [
              '«Стаханов»-40',
              '259 000 руб.',
              '40 кВт',
              '130 л',
              '1210х1665х1710',
              '180 мм',
              '7 м',
              '545 кг',
              '79 кг'
            ],
            [
              '«Стаханов»-63',
              '345 000 руб.',
              '63 кВт',
              '214 л',
              '1360х1785х1815',
              '180 мм',
              '9 м',
              '710 кг',
              '124 кг'
            ],
            [
              '«Стаханов»-100',
              '399 000 руб.',
              '100 кВт',
              '277 л',
              '1610х1785х1940',
              '250 мм',
              '12 м',
              '880 кг',
              '196 кг'
            ]
          ]
        }
      },

      {
        id: 'magna',
        title: 'Zota Magna',
        image: '/img/zota/magna.jpg',
        images: [],
        price: null,
        characteristics: [
          'Новое изделие ZOTA - котел-полуавтомат ZOTA «Magna» с планируемым диапазоном мощности от 15 до 100 кВт, разработан для сжигания в качестве топлива угля любой фракции, дров и топливных брикетов. В качестве резервного (дополнительного) источника энергии можно использовать электричество. Блок ТЭН и модуль управления поставляется опционально;',
          'Загрузка топлива производится вручную, а процесс горения поддерживается нагнетаемым с помощью вентилятора воздухом под контролем модуля управления;',
          'Модуль управления, и датчики являются штатной и неотъемлемой частью котла, позволяющей точно контролировать и максимально долго поддерживать процесс горения. Максимально длительный срок горения достигается не только с помощью устройств автоматизации.',
          'Конструктивные особенности котла исключают подсос воздуха, обеспечивая условия полного сгорания топлива в камере сгорания, создавая свободную циркуляцию теплоносителя и сохраняя тепло, полученное в процессе горения.'
        ],
        docs: null,
        descriptions: [
          'Оригинальная конструкция котла позволяет решить, пожалуй, главную проблему большинства полуавтоматов - быстрый выход на штатный режим горения. Котел Magna выходит на номинальный режим в разы быстрее конкурентов, что дает возможность достигнуть большего кпд с одной стороны и избежать активного задымления окружающей среды с другой.',
          'При этом в режиме номинальной мощности котел работает в течение 9-12 часов, а в длительном режиме до 32 часов.'
        ],
        table: {
          head: [
            'Тип',
            'Цена',
            'Мощность',
            'Объём водяной камеры',
            'Габаритные размеры',
            'Объём погрузочной камеры',
            'Диаметр дымохода',
            'Высота дымохода',
            'Масса'
          ],
          body: [
            [
              'Zota «Magna»-15',
              '75 900 руб.',
              '15 кВт',
              '70 л',
              '370 мм',
              '850x660x1320',
              '5 м',
              '150 мм',
              '240 кг'
            ],
            [
              'Zota «Magna»-20',
              '83 900 руб.',
              '20 кВт',
              '90 л',
              '490 мм',
              '970x660x1320',
              '7 м',
              '150 мм',
              '285 кг'
            ],
            [
              'Zota «Magna»-26',
              '94 900 руб.',
              '26 кВт',
              '110 л',
              '610 мм',
              '1090x660x1320',
              '9 м',
              '150 мм',
              '340 кг'
            ],
            [
              'Zota «Magna»-35',
              '112 900 руб.',
              '35 кВт',
              '170 л',
              '720 мм',
              '1220x700x1580',
              '9 м',
              '180 мм',
              '450 кг'
            ],
            [
              'Zota «Magna»-45',
              '124 900 руб.',
              '45 кВт',
              '210 л',
              '720 мм',
              '1220x700x1820',
              '11 м',
              '180 мм',
              '508 кг'
            ],
            [
              'Zota «Magna»-60',
              '167 900 руб.',
              '60 кВт',
              '280 л',
              '610 мм',
              '1165х1275х1775',
              '9 м',
              '250 мм',
              '680 кг'
            ],
            [
              'Zota «Magna»-80',
              '192 900 руб.',
              '80 кВт',
              '350 л',
              '725 мм',
              '1280х1275х1845',
              '11 м',
              '250 мм',
              '780 кг'
            ],
            [
              'Zota «Magna»-100',
              '209 900 руб.',
              '100 кВт',
              '370 л',
              '725 мм',
              '1280х1275х2000',
              '13 м',
              '250 мм',
              '870 кг'
            ]
          ]
        }
      },

      {
        id: 'topolM',
        title: 'Zota Тополь-М',
        image: '/img/zota/topol-m.jpg',
        images: [],
        price: null,
        characteristics: [
          'Корпус котла стал теплоизолированным и более газоплотным;',
          'Водяная рубашка котла покрыта базальтовым картоном;',
          'Дверца зольника оборудована поддувальной заслонкой;',
          'Увеличившаяся газоплотность позволяет продлить цикл горения топлива на одной загрузке до 10 - 12 часов;',
          'На верхней панели котла установлен термометр, измеряющий температуру подачи воды;',
          '«Тополь-М» использует в качестве топлива уголь и дрова;',
          'Возможно электроотопление, которое обеспечивает встраиваемый блок-ТЭН с внешним пультом управления;',
          'Возможна установка газовой горелки на место шуровочной дверцы;',
          'Глубина топки составляет от 38 до 58 см;',
          'Возможность дополнительной установки комплекта ТЭНБ 2"'
        ],
        docs: [
          '//zota.ru/static/uploaded/documentation/entries/files/pasport_topol-m_14-42.pdf'
        ],
        descriptions: [
          'Котел отопительный твердотопливный «Тополь-М» это модификация котла «Тополь». Он предназначен для работы в автономных отопительных системах с рабочим давлением до 3 атмосфер и может использоваться для отопления жилых и производственных помещений.',
          'Новая линейка была расширена на одну модель меньшей мощности и состоит из трех котлов 14, 20 и 30 кВт. Отличий от предыдущей модели много и они весьма значительные. Первое, что бросается в глаза - новый дизайн. Остальное менее заметно, но гораздо важнее.'
        ],
        table: {
          head: [
            'Тип',
            'Цена',
            'Мощность',
            'Объём водяной камеры',
            'Габаритные размеры',
            'Объём погрузочной камеры',
            'Диаметр дымохода',
            'Высота дымовой трубы',
            'Масса'
          ],
          body: [
            [
              'ZOTA «Тополь-14»',
              '28 290 руб.',
              '14 кВт',
              '46 л',
              '690х440х845',
              '38 л',
              '150 мм',
              '6 м',
              '113 кг'
            ],
            [
              'ZOTA «Тополь-20»',
              '31 990 руб.',
              '20 кВт',
              '54 л',
              '790х440х845',
              '46 л',
              '150 мм',
              '7 м',
              '140 кг'
            ],
            [
              'ZOTA «Тополь-30»',
              '35 890 руб.',
              '30 кВт',
              '64 л',
              '890х440х845',
              '53 л',
              '150 мм',
              '9 м',
              '163 кг'
            ],
            [
              'ZOTA «Тополь-42»',
              '48 990 руб.',
              '42 кВт',
              '78 л',
              '1270х430х1130',
              '84 л',
              '180 мм',
              '9 м',
              '210 кг'
            ]
          ]
        }
      },

      {
        id: 'turboset',
        title: 'Автоматика TurboSet',
        image: '/img/zota/turboset.jpg',
        images: [],
        price: {
          value: 14990,
          currency: 'rub'
        },
        characteristics: [
          'Комплект автоматики ТurboSet автоматизирует процесс горения ручных твердотопливных котлов и дает возможность точно регулировать температуру подачи теплоносителя, продлевая процесс горения на одной закладке топлива.'
        ],
        docs: null,
        descriptions: null
      },

      {
        id: 'tens',
        title: 'Комплект ТЭНБ 2"',
        image: '/img/zota/tens.jpg',
        images: [],
        characteristics: [
          'ТЭНБ (3; 4,5; 6; 7,5; 9; 12; 15 кВт) – блок нагревательных элементов;',
          'ПУ ЭВТ (3; 6; 9; 12; 15 кВт) – панель управления нагревательными элементами с датчиками температуры теплоносителя и воздуха;',
          'Кабель соединительный медный сечение - 4 кв. мм, длина = 2 м;',
          'ТЭНБ – блок с тремя нагревательными элементами из нержавеющей стали. Оригинальная форма нагревателей в виде спиралей обеспечивает больший срок службы и возможность безаварийной работы с незамерзающими теплоносителями;',
          'ПУ ЭВТ – панель управления, позволяет контролировать температуру по двум температурным каналам: по температуре теплоносителя и по температуре воздуха. Использование панели управления возможно не только для обеспечения функции безопасности системы топления, но и для поддержания необходимой и достаточной температуры, которая сэкономит Вам деньги при оплате счетов за электричество.'
        ],
        docs: null,
        descriptions: null,
        table: {
          head: [
            'Тип',
            'Цена',
            'Артикул'
          ],
          body: [
            [
              'Комплект 3 кВт',
              '5 840 руб.',
              'КТ 344332 0003'
            ],
            [
              'Комплект 4,5 кВт',
              '6 030 руб.',
              'КТ 344332 0004'
            ],
            [
              'Комплект 6 кВт',
              '6 070 руб.',
              'КТ 344332 0006'
            ],
            [
              'Комплект 7,5 кВт',
              '6 470 руб.',
              'КТ 344332 0007'
            ],
            [
              'Комплект 9 кВт',
              '6 570 руб.',
              'КТ 344332 0009'
            ],
            [
              'Комплект 12 кВт',
              '7 070 руб.',
              'КТ 344332 0012'
            ],
            [
              'Комплект 15 кВт',
              '7 470 руб.',
              'КТ 344332 0015'
            ]
          ]
        }
      },

      // {
      //   id: 'fr124',
      //   title: 'Регулятор тяги FR-124',
      //   image: '',
      //   images: [
      //     '/img/zota/fr124.jpg',
      //     '/img/zota/fr124-2.jpg'
      //   ],
      //   price: {
      //     value: 2500,
      //     currency: 'rub'
      //   },
      //   characteristics: null,
      //   docs: null,
      //   descriptions: null
      // }
    ]
  }),

  computed: {
    toolbar () {
      return this.lines.map( ({ id , title }) => {
        return {
          id,
          title: title.includes('Zota') ? title.slice(5) : title
        };
      });
    }
  },

  created () {
    this.$emit( 'set-toolbar' , this.toolbar );
  }
};

</script>
