<template>
  <div class="main">

    <section class="product">
      <h1 class="md-display-2">Твёрдотопливные котлы Termokraft</h1>
      <p class="md-body-2">
        Котельная на твёрдом топливе может использоваться даже там, куда не подведены ни газопровод, ни линия электропередач, - твердотопливные котлы полностью автономны. Это преимущество твердотопливных отопительных котлов в сочетании с невысокой стоимостью котла, а также доступностью и дешевизной топлива, обусловливает их популярность в России
      </p>
    </section>

    <Termokraft-Template
      v-for="line in lines" :key="line.id"
      :Line="line" />

  </div>
</template>

<script>

  import TermokraftTemplate from './TermokraftTemplate.vue';

  export default {
    name: 'Termokraft',
    components: { TermokraftTemplate },
    data: () => ({
      lines: [
        {
          id: 'fakel',
          title: 'Fakel',
          image: '/img/termokraft/FAKEL.jpg',
          images: null,
          price: null,
          characteristics: [
            'Мощность, кВт - 10',
            'КПД, % - 76',
            'Высота, мм - 543',
            'Ширина, мм - 420',
            'Глубина, мм - 470/640',
            'Глубина топки, мм - 350',
            'Высота фланца подающей линии, мм - 462',
            'Высота фланца обратной линии, мм - 172',
            'Масса, кг - 70',
            'Номинальное рабочее давление, бар - 1',
            'Максимальное рабочее давление воды в котле, бар - 2',
            'Площадь отапливаемых помещений высотой до 2,7м, м&sup2; - 100',
            'Номинальная температура оборотной воды, °С - 65',
            'Максимальная температура воды на выходе, °С - 95',
            'Температура дымовых газов, °С - 250',
            'Фланцы подключения отопительного контура - 1/2',
            'Диаметр дымохода, мм - 115',
            'Высота дымохода не менее, м - 4',
            'Топливо - дрова, уголь',
            'Цена, руб. - 15 000'
          ],
          docs: null,
          descriptions: [
            'Твердотопливные стальные котлы FAKEL предназначены для отопления индивидуальных жилых домов и зданий коммунально-бытового назначения, оборудованных системами водяного отопления с естественной или принудительной циркуляцией.',
            'Особенностями данного котла являются небольшие габаритные размеры, экономичность, надежность, простота обслуживания и эксплуатации, автоматическая регулировка мощности прямодействующим регулятором тяги.',
            'Благодаря продуманной конструкции котлы FAKEL обеспечивают нагрев воздуха в помещениях площадью до 200 м&sup2;.',
            'Различная производительность котлов FAKEL позволяет подобрать модель с такой мощностью, которая гарантирует самую высокую эффективность и наиболее экономичную работу в Вашем доме.'
          ]
        },

        {
          id: 'taifun',
          title: 'Taifun',
          image: null,
          images: [
            '/img/termokraft/TAIFUN.jpg',
            '/img/termokraft/taifun-2.png'
          ],
          price: null,
          characteristics: [
            'Эффективно работает на основных видах твердого топлива: дрова, уголь;',
            'Возможность установки управляемого блока ТЭНов и рожковой газовой горелки делает котёл пригодным для использования природного газа и электричества;',
            'Комплектуется переходником с шибером для круглой дымоходной трубы, чугунными колосниками, встроенным термометром и автоматическим регулятором тяги;',
            'Удобная топочная дверца открывается в горизонтальной плоскости и закрывается на замок;',
            'Цикл горения твердого топлива на одной загрузке до 8-10 часов;',
            'Рабочее давление котла в системе отопления до 3 атм.;',
            'Наружные поверхности котла облицованы теплоизолирующим материалом на основе базальтового волокна.'
          ],
          docs: null,
          descriptions: [
            'Комбинированный котел Taifun предназначен для отопления индивидуальных жилых домов площадью от 100 до 300 м&sup2;, оборудованных системами водяного отопления с естественной или принудительной циркуляцией.',
            'Особенностями данного котла являются небольшие габаритные размеры, экономичность, надежность, простота обслуживания и эксплуатации, автоматическая регулировка мощности прямодействующим регулятором тяги.'
          ],
          table: {
            head: [
              'Модель котла',
              'Мощность, кВт',
              'КПД, %',
              'Объем загрузочной камеры, л',
              'Размеры В*Ш*Д',
              'Диаметр дымохода, мм',
              'Высота дымохода, м',
              'Масса, кг',
              'Цена, руб*'
            ],
            body: [
              [
                'TAIFUN 12',
                '12',
                '76%',
                '37',
                '800*470*540/890',
                '150',
                '6',
                '115',
                '28 500'
              ],
              [
                'TAIFUN 16',
                '16',
                '76%',
                '42',
                '850*470*590/940',
                '150',
                '7',
                '135',
                '31 000',
              ],
              [
                'TAIFUN 20',
                '20',
                '76%',
                '50',
                '900*470*640/990',
                '150',
                '8',
                '162',
                '34 000',
              ],
              [
                'TAIFUN 30',
                '30',
                '76%',
                '60',
                '1050*470*740/1090',
                '150',
                '10',
                '208',
                '44 000',
              ],
            ]
          }
        },

        {
          id: 'uragan',
          title: 'Uragan',
          image: null,
          images: [
            '/img/termokraft/URAGAN.jpg',
            '/img/termokraft/URAGAN-2.png'
          ],
          price: null,
          characteristics: [
            'Компактность;',
            'Экономичность;',
            'Простота монтажа;',
            'Совместимость с любой системой отопления и дымохода;',
            'Удобство и простота в эксплуатации;',
            'Безопасность и государственный сертификат;',
            'Котел соответствует требованиям ГОСТ 9817-95;',
            'Долговечность. Бесперебойная работа в средней полосе России гарантирована в течении 10 лет;',
            'Информативность. Температуру показывает биметаллический термометр, встроенный в корпус аппарата;',
            'Использование блока ТЭНов. Твердотопливные котлы комплектуются блоком ТЭНов на 6кВт (3х2).'
          ],
          docs: null,
          descriptions: [
            'Котлы URAGAN предназначены для отопления индивидуальных жилых домов и зданий коммунально-бытового назначения, оборудованных системами водяного отопления с естественной или принудительной циркуляцией, а также приготовления пищи.',
            'Особенностями данного котла являются небольшие габаритные размеры, экономичность, надежность, простота обслуживания и эксплуатации. Котлы URAGAN обеспечивают нагрев воздуха в помещениях площадью до 200м&sup2;.'
          ],
          table: {
            head: [
              'Модель котла',
              'Мощность, кВт',
              'КПД, %',
              'Объем загрузочной камеры, л',
              'Размеры В*Ш*Г',
              'Диаметр дымохода, мм',
              'Высота дымохода, м',
              'Масса, кг',
              'Цена, руб*',
            ],
            body: [
              [
                'URAGAN 10',
                '10',
                '75%',
                '13',
                '605*400*490/620',
                '150',
                '6',
                '85',
                '21 000',
              ],
              [
                'URAGAN 14',
                '14',
                '75%',
                '14',
                '690*400*490/620',
                '150',
                '6',
                '105',
                '22 500',
              ],
              [
                'URAGAN 16',
                '16',
                '76%',
                '19',
                '690*400*590/720',
                '150',
                '8',
                '110',
                '23 200',
              ],
              [
                'URAGAN 20',
                '20',
                '76%',
                '28',
                '790*400*590/750',
                '150/200',
                '10/8',
                '125',
                '26 000',
              ]
            ]
          }
        },

        {
          id: 'zeus',
          title: 'Zeus',
          image: null,
          images: [
            '/img/termokraft/ZEUS.png',
            '/img/termokraft/zeus-2.jpg'
          ],
          price: null,
          characteristics: [
            'Трехходовой трубчатый теплообменник;',
            'Стандартное 2’’ подключение к системе;',
            'Улучшенная колосниковая решетка;',
            'Специальный механизм очистки колосников;',
            'Комплектуется блоком ТЭНов;',
            'Котел имеет уменьшенную высоту и расширенный топливный канал, что существенно упрощает загрузку и увеличивает объем загружаемого топлива в котел;',
            'Термоманометр «Watts» и регулятор тяги «Honeywell»;',
            'Легкозаменяемые чугунные колосники;',
            'Внешний корпус с теплоизоляцией;',
            'Отверстия для регулировки подачи дополнительного воздуха;',
            'Комплектуется встроенными турбулизаторами (завихрителями потоков воздуха). Предназначены для повышения КПД котла и для удобства чистки трубчатого теплообменника.',
          ],
          docs: null,
          descriptions: [
            'Полуавтоматические твердотопливные котлы ZEUS предназначенны для отопления индивидуальных жилых домов и зданий коммунально-бытового назначения, оборудованных системами водяного отопления.',
            'Котлы ZEUS обеспечивают нагрев воздуха в помещениях площадью от 50 до 600м2&sup2;. Основной вид топлива – каменный уголь. Благодаря усовершенствованной конструкции котел ZEUS значительно улучшил свои характеристики среди подобных российских аналогов.'
          ],
          table: {
            head: [
              'Наименование',
              'Мощность, кВт',
              'КПД, %',
              'Отпливаемая площадь, м² ',
              'Габариты, мм',
              'Масса, кг',
              'Объём водяной рубашки, л',
              'Диаметр дымохода, мм',
              'Цена, руб',
            ],
            body: [
              [
                'ZEUS 9',
                '9',
                '86%',
                '50-100',
                '350х645х775',
                '150',
                '-',
                '150',
                '31 000',
              ],
              [
                'ZEUS 12',
                '12',
                '86%',
                '90-120',
                '400х645х825',
                '175',
                '26',
                '150',
                '33 500',
              ],
              [
                'ZEUS 16',
                '16',
                '86%',
                '120-160',
                '400х645х875',
                '185',
                '29',
                '150',
                '34 900',
              ],
              [
                'ZEUS 20',
                '20',
                '86%',
                '160-200',
                '500х645х875',
                '235',
                '40',
                '150',
                '42 500',
              ],
              [
                'ZEUS 24',
                '24',
                '86%',
                '200-240',
                '500х645х925',
                '250',
                '45',
                '150',
                '44 500',
              ],
              [
                'ZEUS 32',
                '32',
                '86%',
                '250-320',
                '550х705х925',
                '290',
                '52',
                '200',
                '54 500',
              ],
              [
                'ZEUS 45',
                '45',
                '86%',
                '340-450',
                '650х705х975',
                '330',
                '70',
                '200',
                '66 500',
              ],
              [
                'ZEUS 60',
                '60',
                '86%',
                '500-600',
                '940х1100х1400',
                '540',
                '-',
                '200',
                '93 000',
              ],
            ]
          }
        },

        {
          id: 'r2',
          title: 'R2',
          image: null,
          images: [
            '/img/termokraft/r2.png',
            '/img/termokraft/r2-2.png'
          ],
          price: null,
          characteristics: [
            'Твердотопливный котёл c варочной плитой;',
            'Площадь отопления 70 – 150 м&sup2;;',
            'Мощность 12, 15 кВт;',
            'Основной вид топлива - ДРОВА, УГОЛЬ, БРИКЕТЫ;',
            'Глубина топки 600 и 700 мм;',
            'Блок ТЭН 6 кВт, пульт управления (опция);',
            'Переходник-шибер d 150 мм горизонтальный (опция);',
            'Термометр, регулятор тяги (опция);',
            'Длительность горения до 6-8 часов*',
          ],
          docs: null,
          descriptions: [
            'Компактные размеры, экономичность, простота обслуживания и эксплуатации, универсальность по видам топлива.',
            'Глубокая и ёмкая топочная камера позволяет загружать дрова длиною 600 и 700 мм соответственно.',
            'Стандартные патрубки G2’’ позволяют делать левое, правое либо диагональное подключение к системе.',
            'Круглое сечение дымохода удобно как при встраивании котла в кирпичную трубу, так и при переходе на круглую трубу типа сэндвич (с использованием переходника с шибером).',
            'Большие размеры топочной дверцы котла удобны при загрузке топлива. Дверца зольника с термостойким уплотнителем позволяет точно регулировать подачу воздуха в зону горения.',
            'Зольная камера с вместительным зольным ящиком позволяет комфортно и удобно производить чистку котла.',
            'Наружные поверхности котла облицованы защитно-декоративными панелями, которые снижают потерю тепла теплоносителя, уменьшают инфракрасное излучение и предохраняют владельца от контакта с горячими поверхностями корпуса.',
            'Варочная плита с чугунной конфоркой позволяет приготавливать и разогревать пищу. Через открытую конфорку, возможно, производить чистку котла и загрузку угля.',
            'Предусмотрена возможность установки блока ТЭН и регулятора горения',
            'варочная плита c чугунной комфоркой; возможна установка регулятора тяги',
          ],
          table: {
            head: [
              'Модель котла',
              'R2 12',
              'R2 15',
            ],
            body: [
              [
                'Мощность, кВт',
                '12',
                '15',
              ],
              [
                'КПД, %',
                '76',
                '76',
              ],
              [
                'Высота котла H, мм',
                '610',
                '610',
              ],
              [
                'Ширина котла B, мм',
                '424',
                '424',
              ],
              [
                'Глубина котла D/F, мм',
                '774',
                '854',
              ],
              [
                'Глубина топки котла, мм',
                '590',
                '660',
              ],
              [
                'Высота фланца подающей линии Е, мм',
                '555',
                '555',
              ],
              [
                'Высота фланца обратной линии G, мм',
                '235',
                '235',
              ],
              [
                'Расстояние между фланцами С, мм',
                '320',
                '320',
              ],
              [
                'Диаметр дымоходного канала, мм',
                '150',
                '150',
              ],
              [
                'Масса котла, кг',
                '105',
                '105',
              ],
              [
                'Максимальное рабочее давление воды в котле, бар',
                '3',
                '3',
              ],
              [
                'Площадь отапливаемых помещений высотой до 2,7м, м&sup2;',
                '120',
                '150',
              ],
              [
                'Максимальная температура воды на выходе, °С',
                '95',
                '95',
              ],
              [
                'Номинальная температура оборотной воды**, °С',
                '60-80',
                '60-80',
              ],
              [
                'Температура дымовых газов, °С',
                '130-250',
                '130-250',
              ],
              [
                'Фланцы подключения отопительного контура',
                'G 2"',
                'G 2"',
              ],
              [
                'Диаметр дымохода, мм',
                '150',
                '150',
              ],
              [
                'Высота дымохода не менее, м',
                '6',
                '6',
              ],
              [
                'Мощность блока ТЭНов, кВт',
                '3х2=6',
                '3х2=6',
              ],
              [
                'Напряжение питания ТЭНов, В',
                '220/380',
                '220/380',
              ],
              [
                'Объем водяной рубашки, л',
                '30',
                '32',
              ],
              [
                'Объем загрузочной камеры, л',
                '24',
                '30',
              ],
              [
                'Топливо',
                'дрова, каменный уголь, брикеты',
                'дрова, каменный уголь, брикеты',
              ],
              [
                'Стоимость, р.',
                '19 000',
                '19 500',
              ],
            ]
          }
        },

        {
          id: 'prof',
          title: 'URAGAN ProF',
          image: null,
          images: [
            '/img/termokraft/prof.png',
            '/img/termokraft/prof-2.png'
          ],
          price: null,
          characteristics: [
            'Жаротрубный теплообменник-экономайзер;',
            'Площадь отопления 200 – 450 м&sup2;;',
            'Мощность 26, 32, 45 кВт;',
            'Основной вид топлива - ДРОВА, УГОЛЬ, ГАЗ, ПЕЛЛЕТЫ;',
            'Рабочее давление 3 атм;',
            'Механизм активного дымоудаления;',
            'Водоохлаждаемые колосники;',
            'Шлакорез;',
            'Блок ТЭН 6, 9 кВт, пульт управления;',
            'Дымоход с шибером (вертикальный, горизонтальный) 150 мм;',
            'Термометр, регулятор тяги;',
            'Длительность горения до 8-10 часов.'
          ],
          docs: null,
          descriptions: [
            'Комбинированный котел URAGAN PROF предназначен для отопления индивидуальных жилых домов площадью от 150 до 450 м&sup2;, оборудованных системами водяного отопления с естественной или принудительной циркуляцией.',
            'топливо - дроваот 60см., уголь, газ, пеллеты, эл.энергия, брикеты, дизель'
          ],
          table: {
            head: [
              'Модель котла',
              'URAGAN PROF 26',
              'URAGAN PROF 32',
              'URAGAN PROF 45',
            ],
            body: [
              [
                'Теплопроизводительность, кВт',
                '26',
                '32',
                '45',
              ],
              [
                'Площадь отапливаемых помещений высотой до 2,7м, м²',
                '260',
                '320',
                '450',
              ],
              [
                'КПД, %',
                '86',
                '86',
                '80',
              ],
              [
                'Греющие поверхности котла, м',
                '1,9',
                '2,3',
                '3,2',
              ],
              [
                'Объем загрузочной камеры, л',
                '55',
                '69',
                '77',
              ],
              [
                'Объем воды, л',
                '55',
                '75',
                '100',
              ],
              [
                'Расход каменного угля, кг/час(Q=6450ккал/кг)',
                '4,3',
                '5,4',
                '7,5',
              ],
              [
                'Расход дров, кг/час (Q=2960ккал/кг)',
                '8.0',
                '9.0',
                '14.0',
              ],
              [
                'Высота котла, мм',
                '1160',
                '1160',
                '1280',
              ],
              [
                'Ширина котла, мм',
                '430',
                '480',
                '480',
              ],
              [
                'Длина котла, мм',
                '1100',
                '1160',
                '1240',
              ],
              [
                'Глубина топки котла, мм',
                '560',
                '620',
                '700',
              ],
              [
                'Масса котла, кг',
                '215',
                '250',
                '295',
              ],
              [
                'Диаметр дымохода, мм',
                '150',
                '150',
                '150',
              ],
              [
                'Высота дымохода не менее, м',
                '6',
                '7',
                '7',
              ],
              [
                'Макс. рабочее давление воды в котле, бар',
                '3',
                '3',
                '3',
              ],
              [
                'Макс. температура воды на выходе, °С',
                '95',
                '95',
                '95',
              ],
              [
                'Номинальная температура оборотной воды, °С',
                '65',
                '65',
                '65',
              ],
              [
                'Температура дымовых газов, °С',
                '260',
                '260',
                '260',
              ],
              [
                'Подключения отопительного контура',
                'G 2',
                'G 2',
                'G 2',
              ],
              [
                'Основное топливо',
                'Уголь / дрова / брикеты',
                'Уголь / дрова / брикеты',
                'Уголь / дрова / брикеты',
              ],
              [
                'Дополнительные источники тепловой энергии',
                'Природный газ / пеллеты / электроэнергия',
                'Природный газ / пеллеты / электроэнергия',
                'Природный газ / пеллеты / электроэнергия',
              ],
              [
                'Стоимость, р.',
                '46 000',
                '55 000',
                '70 000',
              ],
            ]
          }
        },

        {
          id: 'fakel-m',
          title: 'FAKEL-M',
          image: null,
          images: [
            '/img/termokraft/fakel-m.jpg',
            '/img/termokraft/fakel-m-2.png'
          ],
          price: null,
          characteristics: [
            'Эффективно работает на основных видах твердого топлива: дрова, уголь. Имеет возможность установки управляемой горелки на газе или жидком топливе, что делает котел более универсальным к дополнительным видам энергии – природному газу и жидкому топливу;',
            'Комплектуется дымососом, чугунными колосниками, терморегулятором, панелью управления и защитной арматурой;',
            'Оснащен автоматикой. Пульт системы контроля позволяет управлять дымососом, вентилятором наддува, горелкой а также отображает на цифровых дисплеях основные рабочие параметры работы котла. Так же автоматика реагирует на достижение предельных значений температуры воды на выходе из котла и на значение давления воды в котле;',
            'Удобная топочная дверца;',
            'Имеет возможность установки поддона с рядом форсунок для сжигания топлива в кипящем слое. Котел с кипящим слоем позволяет добиться устойчивого процесса горения при использовании низкосортных, переувлажненных или высокозольных бурых и каменных углей, что не реализуемо на традиционных котлах с использованием колосниковой решетки;',
            'Цикл горения твердого топлива на одной загрузке до 8-10 часов; Рабочее давление котла в системе отопления до 4 атмосфер;',
            'Наружные поверхности котла облицованы теплоизолирующим материалом на основе базальтового волокна и защитно-декоративными панелями.',
          ],
          docs: null,
          descriptions: [
            'Жаротрубный комбинированный котел FAKEL M (Факел М) (КВР) предназначен для отопления малоэтажных строений площадью от 1000 до 8000 м&sup2;, оборудованных системами водяного отопления.',
            'Комплектуется автоматикой - панель управления, дымосос, арматура.'
          ],
          table: {
            head: [
              'Модель котла',
              'FAKEL-M 100',
              'FAKEL-M 250',
              'FAKEL-M 400',
            ],
            body: [
              [
                'Теплопроизводительность, мВт',
                '0,1',
                '0,25',
                '0,4',
              ],
              [
                'Площадь отапливаемых помещений высотой до 2,7м, м²',
                '1000',
                '2500',
                '4000',
              ],
              [
                'КПД, %',
                '86',
                '91',
                '92',
              ],
              [
                'Греющие поверхности котла, м²',
                '8',
                '21',
                '34',
              ],
              [
                'Расход воздуха, куб.м/час',
                '185',
                '465',
                '745',
              ],
              [
                'Расход каменного угля, кг/час (Q=6450ккал/кг)',
                '17',
                '42',
                '70',
              ],
              [
                'Расход жидкого топлива, куб.м/час',
                '10',
                '25',
                '42',
              ],
              [
                'Расход природного газа, куб.м/час',
                '12',
                '30',
                '50',
              ],
              [
                'Высота котла, мм',
                '1400',
                '1900',
                '2300',
              ],
              [
                'Ширина котла, мм',
                '1000',
                '1250',
                '1350',
              ],
              [
                'Длина котла, мм',
                '1350',
                '1950',
                '2100',
              ],
              [
                'Глубина топки котла, мм',
                '1050',
                '1320',
                '1700',
              ],
              [
                'Масса котла, кг',
                '750',
                '1600',
                '1800',
              ],
              [
                'Диаметр дымохода, мм',
                '250',
                '250',
                '250',
              ],
              [
                'Высота дымохода не менее, м',
                '6',
                '6',
                '6',
              ],
              [
                'Номинальное рабочее давление воды в котле, бар, не более',
                '3',
                '3',
                '3',
              ],
              [
                'Макс. рабочее давление воды в котле, бар',
                '4',
                '4',
                '4',
              ],
              [
                'Макс. температура воды на выходе, °С',
                '95',
                '95',
                '95',
              ],
              [
                'Номинальная температура оборотной воды, °С',
                '65',
                '65',
                '65',
              ],
              [
                'Температура дымовых газов, °С',
                '160',
                '160',
                '160',
              ],
              [
                'Подключения отопительного контура',
                'G3',
                'G3',
                'G3',
              ],
              [
                'Основное топливо',
                'Уголь / дрова',
                'Уголь / дрова',
                'Уголь / дрова',
              ],
              [
                'Дополнительные источники тепловой энергии',
                'Природный газ / Жидкое топливо',
                'Природный газ / Жидкое топливо',
                'Природный газ / Жидкое топливо',
              ],
              [
                'Стоимость, р.',
                '178 920',
                '376 300',
                '580 000',
              ],
            ]
          }
        },

      ]
    }),
    computed: {
      toolbar () {
        return this.lines.map( ({ id , title }) => ({ id , title }) );
      }
    },
    created () {
      this.$emit( 'set-toolbar' , this.toolbar );
    }
  };

</script>
