<template>
  <div class="main">

    <section class="product">
      <h1 class="md-display-2">Банные печи НМК</h1>
      <p class="md-body-2">
        <!-- Котельная на твёрдом топливе может использоваться даже там, куда не подведены ни газопровод, ни линия электропередач, - твердотопливные котлы полностью автономны. Это преимущество твердотопливных отопительных котлов в сочетании с невысокой стоимостью котла, а также доступностью и дешевизной топлива, обусловливает их популярность в России -->
      </p>
    </section>

    <NMK-Stove-Template
      v-for="line in lines"
      :key="line.id"
      :Line="line" />

  </div>
</template>

<script>

  import NMKStoveTemplate from './NMKStoveTemplate.vue';

  export default {
    name: 'NMK-Stoves',

    components: { NMKStoveTemplate },

    data: () => ({
      lines: [

        {
          id: 'kuban',
          title: 'Банная печь "Кубань"',
          image: null,
          images: [
            '/img/nmk-furnaces/kuban-1.jpg',
            '/img/nmk-furnaces/kuban-2.jpg',
            '/img/nmk-furnaces/kuban-3.jpg',
            '/img/nmk-furnaces/kuban-4.jpg',
          ],
          price: {
            value: 18360,
            currency: 'rub'
          },
          characteristics: [
            'Банная печь с панорамным стеклом разработана конструкторским бюро завода «НМК» на основе имеющегося опыта и успешных технологических решений по предыдущим моделям.',
            'Печь надежна, проста и удобна в эксплуатации, имеет высокую теплоотдачу, позволяющую за короткий срок прогреть парильное помещение и удерживать комфортное сочетание температуры и влажности воздуха, а ее внешний вид соответствует духу и тенденциям времени.',
            'Сохраняя добрую традицию производства печей из стали толщиной 6мм, мы руководствовалисьпожеланиями покупателей о долговечности использования банных печей.',
          ],
          docs: null,
          descriptions: null,
          table: '<colgroup> <col width="213"> <col width="64"> <col width="85"> </colgroup> <tbody> <tr height="40"> <td colspan="3">Характеристики банной печи "Кубань"</td> </tr> <tr height="20"> <td>Объем парильного помещения</td> <td>м&sup3;</td> <td>до 24</td> </tr> <tr height="20"> <td>Высота</td> <td>мм</td> <td>785</td> </tr> <tr height="20"> <td>Ширина</td> <td>мм</td> <td>490</td> </tr> <tr height="20"> <td>Длина</td> <td>мм</td> <td>710 </td> </tr> <tr height="20"> <td>Глубина топки</td> <td>мм</td> <td>400 </td> </tr> <tr height="20"> <td>Масса печи</td> <td>кг</td> <td>110 </td> </tr> <tr height="20"> <td>Масса камней</td> <td>кг</td> <td>60 </td> </tr> <tr height="20"> <td>Толщина стали</td> <td>мм</td> <td>6 </td> </tr> </tbody>'
        },

        {
          id: 'katun',
          title: 'Банная печь "Катунь"',
          image: null,
          images: [
            '/img/nmk-furnaces/katun-1.jpg',
            '/img/nmk-furnaces/katun-2.jpg',
            '/img/nmk-furnaces/katun-3.jpg',
          ],
          price: {
            value: 24680,
            currency: 'rub'
          },
          characteristics: [
            'Панорамное стекло делает процесс топки завораживающим. Согласно народной поговорке человек безотрывно может смотреть на три вещи – на огонь, воду, и на то, как другие люди работают. Данная печь объединяет эти три вещи и сделает всё сама – и даст возможность смотреть на живой огонь через термостойкое стекло, согреет воду в баке, а также сделает обстановку в бане тёплой и комфортной. Эстетика камней наполнит парную уютом и создаст неповторимую атмосферу живого общения с природой в Вашей бане.',
          ],
          docs: null,
          descriptions: null,
          table: '<colgroup> <col width="238"> <col width="64"> <col width="61"> </colgroup> <tbody> <tr height="40"> <td colspan="3">Характеристики банной печи "Катунь"</td> </tr> <tr height="20"> <td>Объем парильного помещения</td> <td>М&sup3;</td> <td>До 24</td> </tr> <tr height="20"> <td>Высота</td> <td>мм</td> <td>895</td> </tr> <tr height="20"> <td>Ширина</td> <td>мм</td> <td>565</td> </tr> <tr height="20"> <td>Длина</td> <td>мм</td> <td>780</td> </tr> <tr height="20"> <td>Глубина топки</td> <td>мм</td> <td>400</td> </tr> <tr height="20"> <td>Масса печи</td> <td>Кг</td> <td>125</td> </tr> <tr height="20"> <td>Масса камней</td> <td>Кг</td> <td>200</td> </tr> </tbody>'
        },

        {
          id: 'sibiria-1',
          title: 'Банная печь "Сибирь" со встроенным баком',
          image: null,
          images: [
            '/img/nmk-furnaces/sibir-1-1.jpg',
            '/img/nmk-furnaces/sibir-1-2.jpg',
            '/img/nmk-furnaces/sibir-1-4.jpg',
          ],
          price: {
            value: 26640,
            currency: 'rub'
          },
          characteristics: [
            'Долговечность и надежность. Вся конструкция печи изготовлена из стали толщиной 6мм.',
            'В конструкции печи реализована эффективная схема теплообмена, существенно ускоряющая нагревание воздуха в парильном и смежных помещениях за счет образуемого мощного кругового конвекционного потока;',
            'Глубокая емкая каменка печи является мощным парогенератором. Большое количество качественно нагретых камней обеспечивает стабильную температуру в парильном помещении;',
            'Печь оснащена выносным топливным каналом, что позволяет ее топить из смежного помещения;',
            'Колосниковая решетка из массивного литейного чугуна, обеспечивает равномерное и мощное горение топлива;',
            'Печь снабжена удобным, выдвижным зольником, который также является регулятором интенсивного горения. Он позволяет удалять накопившуюся золу, не прерывая процесс горения;',
            'Все наружные поверхности печи окрашены двумя слоями жаростойкой эмали;',
            'Основной объем каменки приходится на большое пространство, ограниченное наклонной стенкой коллектора, задней стенкой каменки и боковыми стенками, имеющими специальные пазы для циркуляции нагретого воздуха, направляемого боковыми конвекторами из около',
            'топочного пространства. Конструкция коллектора позволяет легко производить очистку дымохода от сажи;',
            'В качестве дополнительного источника топлива возможно использование угля.',
          ],
          docs: null,
          descriptions: null,
          table: '<colgroup> <col width="150"> <col width="60"> <col width="120"> <col width="120"> </colgroup> <tbody> <tr height="60"> <td><b>Модель</b> </td> <td>Ед. изм.</td> <td>«Сибирь» под навесной бак</td> <td>«Сибирь» со встроенным баком</td> </tr> <tr height="40"> <td>Объем парильного помещения</td> <td>м&sup3;</td> <td>До 15</td> <td>До 15</td> </tr> <tr height="20"> <td>Высота</td> <td>мм</td> <td>790</td> <td>790</td> </tr> <tr height="20"> <td>Ширина</td> <td>мм</td> <td>465</td> <td>465</td> </tr> <tr height="20"> <td>Длина</td> <td>мм</td> <td>750</td> <td>1025</td> </tr> <tr height="20"> <td>Глубина топки</td> <td>мм</td> <td>400</td> <td>400</td> </tr> <tr height="20"> <td>Масса печи</td> <td>Кг</td> <td>111</td> <td>126</td> </tr> <tr height="20"> <td>Масса камней</td> <td>Кг</td> <td>60</td> <td>60</td> </tr> </tbody>'
        },

        {
          id: 'sibiria-2',
          title: 'Банная печь "Сибирь" (навесной бак)',
          image: null,
          images: [
            '/img/nmk-furnaces/sibir-2-1.jpg',
            '/img/nmk-furnaces/sibir-2-2.jpg',
            '/img/nmk-furnaces/sibir-2-4.jpg',
          ],
          price: {
            value: 26640,
            currency: 'rub'
          },
          characteristics: [
            'Патрубок дымохода смещен вперед, что дает больше удобств при размещении камней в пространстве каменки и создает более комфортные условия в процессе парения;',
            'Изменена конфигурация облицовочной части, что дало положительные изменения в эстетическом восприятии и создало более четкие формы печи;',
            'Появилась возможность установки теплообменника на корпус печи в моделях под навесной бак, что дает возможность увеличить скорость нагрева воды и располагать бак с горячей водой в моечное помещение;',
            'Изменен цвет облицовочного корпуса. Матовый черный цвет делает внешний вид печи более элегантным и стильным.',
          ],
          docs: null,
          descriptions: [
            'Представляем рестайлинговую модель давно полюбившейся банной печи «Сибирь».',
            'Печи изготовлены с учетом пожеланий покупателей и на основании совершенствования собственного опыта конструкторского бюро завода «НМК». В конструкции печи и ее свойствах учтены рекомендации ценителей русской бани. Печи вобрали в себя мощь и надежность толстостенного металла, обеспечивающего долговечность и простоту в эксплуатации. Благодаря эффективным инженерным решениям печи стали более теплоемкими и способными отвечать высоким требованиям по показателям качества.',
            'Конструкторам завода «НМК» удалось реализовать идею, при которой в качестве дополнительного источника топлива можно использовать бурый уголь, что делает эту печь более привлекательной при использовании в суровых климатических условиях с большими перепадами среднегодовых температур.',
          ],
          table: '<colgroup> <col width="150"> <col width="60"> <col width="120"> <col width="120"> </colgroup> <tbody> <tr height="60"> <td><b>Модель</b> </td> <td>Ед. изм.</td> <td>«Сибирь» под навесной бак</td> <td>«Сибирь» со встроенным баком</td> </tr> <tr height="40"> <td>Объем парильного помещения</td> <td>м&sup3;</td> <td>До 15</td> <td>До 15</td> </tr> <tr height="20"> <td>Высота</td> <td>мм</td> <td>790</td> <td>790</td> </tr> <tr height="20"> <td>Ширина</td> <td>мм</td> <td>465</td> <td>465</td> </tr> <tr height="20"> <td>Длина</td> <td>мм</td> <td>750</td> <td>1025</td> </tr> <tr height="20"> <td>Глубина топки</td> <td>мм</td> <td>400</td> <td>400</td> </tr> <tr height="20"> <td>Масса печи</td> <td>Кг</td> <td>111</td> <td>126</td> </tr> <tr height="20"> <td>Масса камней</td> <td>Кг</td> <td>60</td> <td>60</td> </tr> </tbody>'
        },

      ]
    }),

    computed: {
      toolbar () {
        return this.lines.map( ({ id , title }) => {
          return {
            id,
            title: title.includes('Банная печь') ? title.slice(12) : title
          };
        });
      }
    },

    created () {
      this.$emit( 'set-toolbar' , this.toolbar );
    }

  };

</script>
