<template>
  <div id="main" class="main kentatsu">

    <section class="product">
      <h1 class="md-display-2">Твёрдотопливные котлы Kentatsu Furst Vulkan</h1>
      <p class="md-body-2">
        Котельная на твёрдом топливе может использоваться даже там, куда не подведены ни газопровод, ни линия электропередач, - твердотопливные котлы полностью автономны. Это преимущество твердотопливных отопительных котлов в сочетании с невысокой стоимостью котла, а также доступностью и дешевизной топлива, обусловливает их популярность в России.
      </p>
    </section>

    <Kentatsu-Template
      v-for="line in lines" :key="line.id"
      :Line="line" />

  </div>
</template>

<script>

  import KentatsuTemplate from './KentatsuTemplate.vue';

  export default {
    name: 'Kentatsu',

    components: { KentatsuTemplate },

    data: () => ({
      lines: [

        {
          id: 'elegant',
          title: 'Kentatsu Furst Elegant',
          image: '/img/kentatsu/elegant.jpg',
          images: [],
          price: null,
          characteristics: [
            'Поверхность теплообмена увеличена за счет дополнительных рёбер в каналах отходящих дымовых газов;',
            'Механический термостат в комплекте; ',
            'Регулировка температуры теплоносителя;',
            'Термометр на передней панели котла;',
            'Регулятор вторичного воздуха, снижающий уровень выбросов в атмосферу;',
            'Водоохлаждаемые колосники котлов;',
            'Котлы Elegant могут работать на дровах и угле;',
            'Приспособления для тех.обслуживания в комплекте.',
          ],
          docs: null,
          descriptions: [
            'Котлы Kentatsu Furst Elegant предназначены для отопления жилых и производственных помещений. Используются в системах отопления с естественной или принудительной циркуляцией и представлены в диапазоне мощности от 15 до 41 кВт.',
            'Теплообменники котлов изготовлены из высококачественного чугуна.  Для снижения тепловых потерь теплообменники котлов изолированы минеральной ватой толщиной 80 мм и экранированы алюминиевой фольгой.',
          ],
          table: {
            head: [
              'Модель котла',
              'Мощность котла, кВт (уголь)',
              'Мощность котла, кВт (дрова)',
              'Время сгорания угля, час',
              'Время сгорания дров, час',
              'Объём воды в котле, л',
              'Глубина * ширина * высота мм',
              'Размеры камеры сгорания,	Ш*В, мм',
              'Глубина камеры сгорания,	мм',
              'Диаметр дымохода, мм',
              'Вес,кг',
              'Цена без скидки, USD',
              'Цена со скидкой, USD',
            ],
            body: [
              [ 'Elegant 03', '15-17', '12-14', '4', '2', '16,3', '609 * 450 * 947', '300*380', '245', '180', '166', '858', '858', ],
              [ 'Elegant 04', '24-27', '18-20', '4', '2', '20,3', '709 * 450 * 947', '300*380', '345', '180', '198', '1009', '1009', ],
              [ 'Elegant 05', '31-34', '25-27', '4', '2', '24,3', '809 * 450 * 947', '300*380', '445', '180', '232', '1162', '1162', ],
              [ 'Elegant 06', '38-41', '30-33', '4', '2', '28,2', '909 * 450 * 947', '300*380', '545', '180', '267', '1316', '1316', ],
            ]
          }
        },

        {
          id: 'sr',
          title: 'Kentatsu Furst SR (Max SR)',
          image: '/img/kentatsu/SR.jpg',
          images: [],
          price: null,
          characteristics: [
            'Панель управления с микропроцессором;',
            'Поддержание заданной пользователем температуры теплоносителя;',
            'Сигнализация при неисправностях и/или отсутствии топлива;',
            'Возможность подключения дополнительного термостата/контроллера;',
            'Котлы Vulkan SR, Vulkan Max SR могут работать на древесине, угле, топливных брикетах, торфе;',
            'Приспособления для тех.обслуживания в комплекте.',
          ],
          docs: null,
          descriptions: [
            'Котлы Kentatsu Furst Vulkan SR (Max SR) предназначены для отопления жилых и производственных помещений. Применяются в системах отопления с принудительной циркуляцией и представлены в диапазоне мощности от 23 до 1188 кВт.'
          ],
          table: {
            head: [ 'Модель котла', 'Мощность, кВт', 'Ширина, мм', 'Длина, мм', 'Высота, мм', 'Диаметр дымохода, мм', 'Объём воды в котле, л', 'Вес котла, кг', 'Цена без скидки, USD', 'Цена со скидкой, USD', ],
            body: [
              [ 'SR 20', '23', '510', '710', '1160', '130', '55', '160', '2008', '2008', ],
              [ 'SR 25', '29', '510', '710', '1280', '130', '62', '180', '2237', '2237', ],
              [ 'SR 35', '41', '670', '710', '1350', '130', '80', '260', '2476', '2476', ],
              [ 'SR 45', '53', '670', '820', '1350', '130', '95', '300', '2725', '2725', ],
              [ 'SR 60', '70', '770', '950', '1470', '170', '140', '400', '3165', '3165', ],
              [ 'SR 80', '93', '770', '1130', '1470', '170', '180', '500', '3614', '3614', ],
              [ 'SR 100', '116', '730', '1400', '1630', '170', '274', '600', '4637', '4637', ],
              [ 'Max SR-120', '140', '830', '1300', '1630', '210', '286', '760', '5670', '5670', ],
              [ 'Max SR-140', '163', '830', '1400', '1630', '210', '336', '940', '5890', '5890', ],
              [ 'Max SR-160', '186', '730', '1400', '1630', '270', '380', '1000', '6282', '6282', ],
              [ 'Max SR-180', '210', '830', '1400', '1910', '270', '420', '1120', '6836', '6836', ],
              [ 'Max SR-200', '233', '830', '1690', '1910', '270', '460', '1350', '8203', '8203', ],
              [ 'Max SR-250', '291', '940', '1850', '1910', '270', '570', '1650', '10125', '10125', ],
              [ 'Max SR-300', '349', '940', '2150', '2020', '270', '730', '2000', '12037', '12037', ],
              [ 'Max SR-350', '407', '1040', '2250', '2020', '330', '860', '2400', '13519', '13519', ],
              [ 'Max SR-400', '466', '1140', '2400', '2020', '330', '925', '2800', '14743', '14743', ],
              [ 'Max SR-450', '525', '1120', '2600', '2020', '330', '1050', '3200', '16588', '16588', ],
              [ 'Max SR-500', '581', '1240', '2600', '2020', '350', '1200', '3600', '18663', '18663', ],
              [ 'Max SR-600', '698', '1340', '2750', '2020', '350', '1380', '4200', '20671', '20671', ],
              [ 'Max SR-700', '814', '1440', '2850', '2020', '400', '1820', '4850', '23845', '23845', ],
              [ 'Max SR-800', '930', '1540', '2950', '2020', '400', '2000', '5200', '27057', '27057', ],
              [ 'Max SR-900', '1048', '1640', '3050', '2020', '450', '2150', '5450', '30146', '30146', ],
              [ 'Max SR-1000', '1164', '1740', '3150', '2020', '450', '2500', '5800', '33540', '33540', ],
            ]
          }
        },

        {
          id: 'pr',
          title: 'Kentatsu Furst PR (PE)',
          image: '/img/kentatsu/PR.jpg',
          images: [],
          price: null,
          characteristics: [
            'Электронная панель управления;',
            'Автоматическая подача топлива дутьевым вентилятором;',
            'Возможность плавного регулирования мощности котлов;',
            'Тип розжига: ручной (PR) или автоматический (PE);',
            'Бункер для хранения топлива;',
            'Герметично закрывающаяся крышка бункера;',
            'Типы твердого топлива фракцией до 30 мм: уголь, брикетированный торф, топливные брикеты;',
            'Возможно подключение дополнительного термостата/контроллера;',
            'Модели котлов Vulkan 30P – 50P опционально комплектуются циркуляционными насосами;',
            'Приспособления для тех.обслуживания в комплекте.',
          ],
          docs: null,
          descriptions: [
            'Котлы Kentatsu Furst (PE) предназначены для отопления жилых и производственных помещений. Применяются в системах отопления с принудительной циркуляцией и представлены в диапазоне мощности от 35 до 105 кВт.'
          ],
          banner: '/img/kentatsu/PR-2.png',
          table: {
            head: [ 'Модель котла', 'Мощность, кВт', 'Ширина, мм', 'Длина, мм', 'Высота, мм', 'Диаметр дымохода, мм', 'Объём воды в котлы, л', 'Вес котла, кг', 'Объём бункера, л	', 'Цена без скидки, руб.', 'Цена со скидкой, руб.', ],
            body: [
              [ '(PE) 30P', '35', '510', '770', '1280', '130', '62', '240', '100', '220860', '165645', ],
              [ '(PE) 40P', '47', '610', '770', '1350', '130', '80', '340', '170', '235200', '176400', ],
              [ '(PE) 50P', '58', '610', '880', '1350', '130', '95', '350', '170', '263280', '197460', ],
              [ '(PE) 70', '81', '715', '950', '1470', '170', '140', '500', '220', '289140', '216855', ],
              [ '(PE) 100', '105', '715', '1130', '1470', '170', '180', '650', '220', '328680', '246510', ],
            ]
          }
        },

        {
          id: 'mPR',
          title: 'Kentatsu Furst Max PR (PE)',
          image: '/img/kentatsu/mPR.jpg',
          images: [],
          price: null,
          characteristics: [
            'Электронная панель управления;',
            'Автоматической подача топлива дутьевым вентилятором;',
            'Возможность плавного регулирования мощности котлов;',
            'Тип розжига: ручной (PR) или автоматический (PE);',
            'Бункер для хранения топлива;',
            'Герметично закрывающаяся крышка бункера;',
            'Зернистость угля не более 30 мм;',
            'Возможность подключения дополнительного термостата/контроллера;',
            'Приспособления для тех.обслуживания в комплекте.',
          ],
          banner: '/img/kentatsu/mPR-2.png',
          docs: null,
          descriptions: [
            'Котлы Kentatsu Furst Vulkan Max PR (PE) предназначены для отопления жилых и производственных помещений. Применяются в системах отопления с принудительной циркуляцией и представлены в диапазоне мощности от 140 до 1188 кВт.'
          ],
          table: {
            head: [ 'Модель котла', 'Мощность, кВт', 'Ширина, мм', 'Длина, мм', 'Высота, мм', 'Диаметр дымохода, мм', 'Объём воды в котлы, л', 'Вес котла, кг', 'Объём бункера, л	', 'Цена без скидки, руб.', 'Цена со скидкой, руб.', ],
            body: [
              [ '(PE) 120', '140', '730', '1500', '1600', '170', '274', '610', '260', '555300', '416475', ],
              [ '(PE) 140', '163', '710', '1200', '1800', '210', '286', '860', '260', '578220', '433665', ],
              [ '(PE) 160', '186', '710', '1330', '1800', '210', '336', '950', '260', '602340', '451755', ],
              [ '(PE) 180', '210', '730', '1600', '1910', '270', '380', '1100', '360', '644220', '483165', ],
              [ '(PE) 200', '233', '830', '1600', '1910', '270', '420', '1220', '630', '698160', '523620', ],
              [ '(PE) 220', '256', '830', '1890', '2020', '270', '460', '1450', '630', '854760', '641070', ],
              [ '(PE) 270', '314', '940', '2050', '2020', '270', '570', '2000', '630', '899460', '674595', ],
            ]
          }
        },

      ]
    }),

    computed: {
      toolbar () {
        return this.lines.map( ({ id , title }) => {
          return {
            id, title: title.slice(9)
          };
        });
      }
    },

    created () {
      this.$emit( 'set-toolbar' , this.toolbar );
    }
  };

</script>

<style lang="scss">

  .main.kentatsu {
    .md-table-head-container,
    .md-table-head-label {
      height: initial;
      overflow: unset;
      text-overflow: unset;
      white-space: unset;
    }
  }

</style>
