<template>
  <div class="main">

    <section class="product">
      <h1 class="md-display-2">Твёрдотопливные котлы Belkomin</h1>
      <p class="md-body-2">
        Котельная на твёрдом топливе может использоваться даже там, куда не подведены ни газопровод, ни линия электропередач, - твердотопливные котлы полностью автономны. Это преимущество твердотопливных отопительных котлов в сочетании с невысокой стоимостью котла, а также доступностью и дешевизной топлива, обусловливает их популярность в России
      </p>
    </section>

    <Belkomin-Template
      v-for="line in lines"
      :key="line.id"
      :Line="line" />

  </div>
</template>

<script>

  import BelkominTemplate from './BelkominTemplate.vue';

  export default {
    name: 'Belkomin',
    components: { BelkominTemplate },
    data: () => ({
      lines: [

        {
          id: 'tis15',
          title: 'Серия 15',
          images: [
            '/img/belkomin/TIS_PRO_1.png',
            '/img/belkomin/TIS_PRO_2.png',
            '/img/belkomin/TIS_PRO_3.png',
            '/img/belkomin/TIS_PRO_4.png',
            '/img/belkomin/TIS_PRO_5.png',
            '/img/belkomin/TIS_PRO_6.png',
          ],
          price: null,
          characteristics: [
            'Котел предназначен  для обогрева жилых и промышленных объектов,  а так же приготовления горячей воды совместно с водонагревателем;',
            'Котёл изготовлен из европейской высокопрочной котловой стали марки P265GH толщиной 5мм;',
            'Чистка и обслуживание котла, включая  теплообменник, проводятся с передней части котла;',
            'Порошковое покрытие обшивки котла;',
            'Теплоизоляция котла 50 мм;',
            'Система подачи воздуха в первичную и во вторичную камеру сгорания;',
            'Широкий угол раскрытия дверей;',
            'Котел оснащен механическим регулятором тяги по заданной температуре;',
            'Коэффициент полезного действия, при номинальной мощности, не менее 82%.',
            'Опционально котел может быть оснащен вентилятором и автоматикой.'
          ],
          docs: [
            '//www.belkomin.com/assets/download/_PRO_PLUS_1.3.pdf'
          ],
          descriptions: [
            'TIS PRO 15 –  это современный энергонезависимый котел длительного горения, предназначенный для сжигания дров, торфа, угля и древесных отходов, оснащенный механическим регулятором тяги по заданной температуре. Благодаря уникальным инновационным технологиям и конструктивным особенностям котла, достигается полное извлечение тепловой энергии сжигаемого топлива.',
            'Система подачи воздуха в первичную и во вторичную камеру сгорания обеспечивает максимальный дожег выделяемых газов. Температура отработанных газов не более 130 - 150°C, тем самым достигается высокий  КПД и увеличивается время работы котла на одной загрузке  до 12 ч. (в котлах ТИС ПРО др 22, 17, 27 время работы котла больше на 4 часа). Отличительная черта этого котла - это увеличенная топка по сравнению к аналогичным котлам производимым в Европе. Удобные широко открывающиеся двери ,  чугунные колосники.  Номинальная мощность 6-30 кВт;',
          ],
          table: {
            head: [
              'Модель котла',
              'TIS-......',
              'PRO 15'
            ],
            body: [
              [
                'Мощность',
                'кВт',
                '8-15',
              ],
              [
                'Отапливаемая площадь',
                'м2',
                'до 130',
              ],
              [
                'Максимальная рабочая температура',
                'С',
                '85',
              ],
              [
                'Объем воды в котле',
                'литр',
                '40',
              ],
              [
                'Минимальная тяга дымохода',
                'Па',
                '20',
              ],
              [
                'Подключения',
                'дюйм',
                '1 1/2',
              ],
              [
                'Диаметр дымохода',
                'мм',
                '159',
              ],
              [
                'Масса котла',
                'кг',
                '253',
              ],
              [
                'Объем топки',
                'дм3',
                '61',
              ],
              [
                'Ширина*',
                'см',
                '46',
              ],
              [
                'Глубина*',
                'см',
                '57',
              ],
              [
                'Высота*',
                'см',
                '138',
              ],
            ]
          }
        },

        {
          id: 'tis20',
          title: 'Серия 20',
          images: [
            '/img/belkomin/TIS_PRO_1.png',
            '/img/belkomin/TIS_PRO_2.png',
            '/img/belkomin/TIS_PRO_3.png',
            '/img/belkomin/TIS_PRO_4.png',
            '/img/belkomin/TIS_PRO_5.png',
            '/img/belkomin/TIS_PRO_6.png',
          ],
          price: null,
          characteristics: [
            'Котел предназначен для обогрева жилых и промышленных объектов,  а так же приготовления горячей воды совместно с водонагревателем;',
            'Котёл изготовлен из европейской высокопрочной котловой стали марки P265GH толщиной 5мм;',
            'Чистка и обслуживание котла, включая  теплообменник, проводятся с передней части котла;',
            'Порошковое покрытие обшивки котла;',
            'Теплоизоляция котла 50 мм;',
            'Система подачи воздуха в первичную и во вторичную камеру сгорания;',
            'Широкий угол раскрытия дверей;',
            'Котел оснащен механическим регулятором тяги по заданной температуре;',
            'Коэффициент полезного действия, при номинальной мощности, не менее 82%.',
            'Опционально котел может быть оснащен вентилятором и автоматикой.'
          ],
          docs: [
            '//www.belkomin.com/assets/download/_PRO_PLUS_1.3.pdf'
          ],
          descriptions: [
            'TIS PRO 15 –  это современный энергонезависимый котел длительного горения, предназначенный для сжигания дров, торфа, угля и древесных отходов, оснащенный механическим регулятором тяги по заданной температуре. Благодаря уникальным инновационным технологиям и конструктивным особенностям котла, достигается полное извлечение тепловой энергии сжигаемого топлива.',
            'Система подачи воздуха в первичную и во вторичную камеру сгорания обеспечивает максимальный дожег выделяемых газов. Температура отработанных газов не более 130 - 150°C, тем самым достигается высокий  КПД и увеличивается время работы котла на одной загрузке  до 12 ч. (в котлах ТИС ПРО др 22, 17, 27 время работы котла больше на 4 часа). Отличительная черта этого котла - это увеличенная топка по сравнению к аналогичным котлам производимым в Европе. Удобные широко открывающиеся двери ,  чугунные колосники.  Номинальная мощность 6-30 кВт;',
          ],
          table: {
            head: [ 'Модель котла', 'TIS-...... ', 'PRO 15', ],
            body: [
              [ 'Мощность', 'кВт', '8-15', ],
              [ 'Отапливаемая площадь', 'м2', 'до 130', ],
              [ 'Максимальная рабочая температура', 'С', '85', ],
              [ 'Объем воды в котле', 'литр', '40', ],
              [ 'Минимальная тяга дымохода', 'Па', '20', ],
              [ 'Подключения', 'дюйм', '1 1/2', ],
              [ 'Диаметр дымохода', 'мм', '159', ],
              [ 'Масса котла', 'кг', '253', ],
              [ 'Объем топки', 'дм3', '61', ],
              [ 'Ширина*', 'см', '46', ],
              [ 'Глубина*', 'см', '57', ],
              [ 'Высота*', 'см', '138', ]]
          }
        },

        {
          id: 'pro-20',
          title: 'PRO 20',
          images: [
            '/img/belkomin/TIS_PRO_1.png',
          ],
          price: null,
          characteristics: [
            '',
          ],
          docs: [
            '',
          ],
          descriptions: [
            '',
          ],
          table: {
            head: [ 'Модель котла', 'TIS-......', 'PRO 20' ],
            body: [
              [ 'Мощность', 'кВт', '10-20' ],
              [ 'Отапливаемая площадь', 'м2', 'до 180' ],
              [ 'Максимальная рабочая температура', 'С', '85' ],
              [ 'Объем воды в котле', 'литр', '40' ],
              [ 'Минимальная тяга дымохода', 'Па', '20' ],
              [ 'Подключения', 'дюйм', '1 1/2' ],
              [ 'Диаметр дымохода', 'мм', '159' ],
              [ 'Масса котла', 'кг', '277' ],
              [ 'Объем топки', 'дм3', '70' ],
              [ 'Ширина*', 'см', '46' ],
              [ 'Глубина*', 'см', '62' ],
              [ 'Высота*', 'см', '138' ]
            ]
          }
        },

        {
          id: 'pro-25',
          title: 'PRO 25',
          images: [
            '/img/belkomin/TIS_PRO_1.png',
          ],
          price: null,
          characteristics: [
            '',
          ],
          docs: [
            '',
          ],
          descriptions: [
            '',
          ],
          table: {
            head: [ 'Модель котла', 'TIS-......', 'PRO 25' ],
            body: [
              [ 'Мощность', 'кВт', '15-25' ],
              [ 'Отапливаемая площадь', 'м2', 'до 230' ], [ 'Максимальная рабочая температура', 'С', '85' ], [ 'Объем воды в котле', 'литр', '50' ], [ 'Минимальная тяга дымохода', 'Па', '22' ], [ 'Подключения', 'дюйм', '1 1/2' ], [ 'Диаметр дымохода', 'мм', '159' ], [ 'Масса котла', 'кг', '293' ], [ 'Объем топки', 'дм3', '80' ], [ 'Ширина*', 'см', '46' ], [ 'Глубина*', 'см', '67' ], [ 'Высота*', 'см', '138' ]]
          }
        },

        {
          id: 'pro-30',
          title: 'PRO 30',
          images: [
            '/img/belkomin/TIS_PRO_1.png',
          ],
          price: null,
          characteristics: [
            '',
          ],
          docs: [
            '',
          ],
          descriptions: [
            '',
          ],
          table: {
            head: [
              'Модель котла',
              'TIS-......',
              'PRO 30'
            ],
            body: [
              [
                'Мощность',
                'кВт',
                '15-30'
              ],
              [
                'Отапливаемая площадь',
                'м2',
                'до 280'
              ],
              [
                'Максимальная рабочая температура',
                'С',
                '85'
              ],
              [
                'Объем воды в котле',
                'литр',
                '60'
              ],
              [
                'Минимальная тяга дымохода',
                'Па',
                '22'
              ],
              [
                'Подключения',
                'дюйм',
                '1 1/2'
              ],
              [
                'Диаметр дымохода',
                'мм',
                '159'
              ],
              [
                'Масса котла',
                'кг',
                '311'
              ],
              [
                'Объем топки',
                'дм3',
                '90'
              ],
              [
                'Ширина*',
                'см',
                '46'
              ],
              [
                'Глубина*',
                'см',
                '72'
              ],
              [
                'Высота*',
                'см',
                '138'
              ]
            ]
          }
        },

        {
          id: 'dr',
          title: 'Серия PRO DR',
          images: [
            '/img/belkomin/TIS_PRO_1.png',
          ],
          price: null,
          characteristics: [
            '',
          ],
          docs: [
            '',
          ],
          descriptions: [
            '',
          ],
          table: {
            head: ['Модель котла','TIS PRO DR...','17','22','27'],
            body: [
              ['Мощность','кВт','10-17','12-22','17-27'],
              ['Отапливаемая площадь','м2','до 150','до 200','до 250'],
              ['Максимальная рабочая температура','С','85','85','85'],
              ['Объем воды в котле','литр','50','60','60'],
              ['Минимальная тяга дымохода','Па','20','20','20'],
              ['Подключения','дюйм','1 1/2','1 1/2','1 1/2'],
              ['Диаметр дымохода','мм','159','159','159'],
              ['Масса котла','кг','281','308','331'],
              ['Объем топки','дм3','80','99','116'],
              ['Ширина*','см','44','51','58'],
              ['Глубина*','см','78','78','78'],
              ['Высота*','см','117','117','117'],
            ]
          }
        },

        {
          id: 'plus',
          title: 'Серия Plus',
          images: [
            '/img/belkomin/TIS_PLUS_1.png',
            '/img/belkomin/TIS_PLUS_2.png',
            '/img/belkomin/TIS_PLUS_3.png',
            '/img/belkomin/TIS_PLUS_4.png',
            '/img/belkomin/TIS_PLUS_5.png',
            '/img/belkomin/TIS_PLUS_6.png',
          ],
          price: null,
          characteristics: [
            'Котел предназначен для обогрева жилых и промышленных объектов, а также приготовления горячей воды совместно с водонагревателем;',
            'Система подачи воздуха в первичную и во вторичную камеру сгорания;',
            'Котёл изготовлен из европейской высокопрочной котловой стали марки P265GH толщиной 5мм;',
            'Чистка и обслуживание котла, включая  теплообменник, проводятся с передней части котла;',
            'Порошковое покрытие обшивки котла;',
            'Теплоизоляция котла 50мм;',
            'Широкий угол раскрытия дверей;',
            'При отключении питания, котел приспособлен для сжигания топлива с естественной тягой.',
            'Работа котла по заданной температуре с плавным переходом в режим тления по её достижению;',
            'Система термозащиты, препятствующая воспламенению запасов топлива и разрушению узлов котла;',
            'Возможность управления насосом ГВС;',
            'Возможность подключения комнатного терморегулятора.'
          ],
          docs: [
            '//www.belkomin.com/assets/download/_PRO_PLUS_1.3.pdf',
          ],
          descriptions: [
            'TIS PLUS - это современный котел длительного горения, предназначенный для сжигания дров, торфа, угля и древесных отходов, оснащенный автоматическим блоком управления, а так же вентилятором. Благодаря уникальным инновационным технологиям и конструктивным особенностям котла, достигается полное извлечение тепловой энергии сжигаемого топлива. Система подачи воздуха в первичную и во вторичную камеру сгорания обеспечивает максимальный дожег выделяемых газов. Температура отработанных газов не более 130*-150*С, тем самым достигается высокий КПД и увеличивается время работы котла на одной загрузке до 16 ч., елси необходим более мощный аппарат, рекомендуем рассмотреть котел серии TIS uni 25 с продолжительностью горения 24 часа!  Отличительная черта этого котла - это увеличенная топка по сравнению к аналогичным котлам, производимым в Европе. Удобные широко открывающиеся двери ,  чугунные колосники. Номинальная мощность 6-30 кВт;',
            'Котел оснащен вентилятором и автоматикой TIS-tronic 210, которая позволяет управлять работой вентилятора с модулируемой скоростью (Использование модуляции приводит к уменьшению расхода топлива), насосом центрального отопления (ЦО), а так же позволяет программировать процесс горения в зависимости от вида топлива и условий эксплуатации;'
          ],
          table: {
            head: [ 'Модель котла', 'TIS PLUS...', '11','15','20' ],
            body: [
              ['Мощность','кВт','6-11','8-15','10-20'],
              ['Отапливаемая площадь','м2','до 100','до 130','до 180'],
              ['Максимальная рабочая температура','С','85','85','85'],
              ['Объем воды в котле','литр','30','40','50'],
              ['Минимальная тяга дымохода','Па','18','20','20'],
              ['Подключения','дюйм','1 1/2','1 1/2','1 1/2'],
              ['Диаметр дымохода','мм','108','159','159'],
              ['Вес котла','кг','182','255','279'],
              ['Объем топки','дм3','31','61','70'],
              ['Длина*','см','55','57','62'],
              ['Ширина*','см','37','46','46'],
              ['Высота*','см','113','138','138'],
            ]
          }
        },

        {
          id: 'tis-hard',
          title: 'TIS HARD',
          images: [
            '/img/belkomin/tis-hard-plus.png',
          ],
          price: null,
          characteristics: [
            'Котел предназначен для обогрева жилых и промышленных объектов, а также приготовления горячей воды совместно с водонагревателем;',
          ],
          docs: [
            '//www.belkomin.com/assets/download/instr_hard_plus.pdf',
          ],
          descriptions: [
            'TIS HARD PLUS (150-490) - это современный усовершенствованный котел длительного горения мощностью от 150 до 500 кВт, предназначенный для сжигания дров, торфа, угля и древесных отходов, оснащенный автоматическим блоком управления, а также модулируемыми вентиляторами.',
            'Благодаря уникальным инновационным технологиям и конструктивным особенностям котла достигается полное извлечение тепловой энергии сжигаемого топлива. Система подачи воздуха в первичную и во вторичную камеру сгорания обеспечивает максимальный дожит выделяемых газов.Температура отработанных газов не более 130-150°С, тем самым достигается высокий КПД. Котел оснащен автоматикой TIS tronic 470Н которая позволяет управлять работой 2-х (одного) вентиляторов с модулируемой скоростью, насосом защиты, а также позволяет программировать процесс горения в зависимости от вида топлива и условий эксплуатации;',
            'Котел оснащен регулятором TIS TRONIC 470Н, контроллер является современным электронным устройством, предназначенным для управления работой котла на твердом топливе. Регулятор является устройством многофункциональным и самостоятельно поддерживает заданную температуру котла, контролируя процесс горения топлива. В комплект входит панель управления с вертикальной регуляцией положения, главный силовой модуль. Регулятор может использоваться в рамках систем отопления в зданиях промышленного значения.',
          ],
          table: {
            head: ['Модель котла','TIS HARD…','PLUS 120','PLUS 150','PLUS 200','PLUS 250','PLUS 300','PLUS 350','PLUS 400','PLUS 490'],
            body: [
              ['Мощность','кВт','40-120','55-150','65-200','85-250','95-300','115-350','130-400','160-495'],
              ['Отапливаемая площадь','м2','','','','','','','',''],
              ['Максимальная рабочая температура','ᵒС','85','85','85','85','85','85','85','85'],
              ['Объем воды в котле','литр','380','420','710','900','1190','1325','1460','1950'],
              ['Минимальная тяга дымохода','Па','22','22','22','22','22','22','22','22'],
              ['Подключения','дюйм','2','2','Dy80','Dy80','Dy80','Dy80','Dy80','Dy80'],
              ['Диаметр дымохода','мм','220','220','300','300','300','300','350','350'],
              ['Вес котла','кг','841','904','1729','1910','2734','2821','3200','3525'],
              ['Объем топки','дм³','501','601','908','1010','1050','1181','1312','1443'],
              ['Ширина*','см','74','74','84','84','98','98','98','98'],
              ['Глубина*','см','146','160','200','220','205','225','245','265'],
              ['Высота*','см','168','168','168','168','212','212','212','212']
            ]
          }
        },

        {
          id: 'uni',
          title: 'Серия UNI',
          images: [
            '/img/belkomin/TIS_UNI_1.png',
            '/img/belkomin/TIS_UNI_2.png',
            '/img/belkomin/TIS_UNI_3.png',
            '/img/belkomin/TIS_UNI_4.png',
            '/img/belkomin/TIS_UNI_5.png',
          ],
          price: null,
          characteristics: [
            'Коэффициент полезного действия, при номинальной мощности, не менее 82%;',
            'Многоступенчатая система подачи воздуха в первичную и во вторичную камеру сгорания;',
            'Котёл изготовлен из европейской высокопрочной котловой стали марки P265GH толщиной 5мм;',
            'Чистка и обслуживание котла, включая  теплообменник, проводятся с передней части котла;',
            'Порошковое покрытие обшивки котла;',
            'Теплоизоляция котла 50 мм;',
            'Широкий угол раскрытия дверей;',
            'Возможность работы в каскаде;',
            'При отключении питания, котел приспособлен для сжигания топлива с естественной тягой;'
          ],
          docs: [
            '//www.belkomin.com/assets/download/_UNI_1.5.pdf',
          ],
          descriptions: [
            'TIS UNI – это современный котел длительного горения ПРЕМИУМ КЛАССА, для сжигания дров, торфа, угля и древесных отходов, оснащенный интеллектуальным пультом управления и новейшим модулируемым вентилятором. Отличительная черта этого котла это увеличенная загрузочная камера, долговечные чугунные колосники.  Благодаря уникальным инновационным технологиям и конструктивным особенностям котла, достигается полное извлечение тепловой энергии сжигаемого топлива. Многоступенчатая система подачи воздуха в первичную и во вторичную камеру сгорания обеспечивает максимальный дожег выделяемых газов. Температура отработанных газов не более 130*-150*С, тем самым достигается  высокий  КПД и увеличивается время работы котла на одной загрузке  до 24 ч. По мощности с котлами этой серии может посоперничать только котел TIS pellet 25, иновационное решение укомплектованное автоматикой.',
          ],
          table: {
            head: ['Модель котла','UNI','15','25','35','45','55','65','75','85','95'],
            body: [
              ['Мощность','кВт','8-20','10-30','15-40','20-50','25-60','30-70','35-80','40-90','45-99'],
              ['Отапливаемая площадь','м2, до','180','280','380','480','580','680','780','880','980'],
              ['Максимальная рабочая температура','С','85','85','85','85','85','85','85','85','85'],
              ['Объем воды в котле','литр','80','90','110','120','150','160','170','180','180'],
              ['Минимальная тяга дымохода','Па','18','18','20','20','22','22','22','22','22'],
              ['Подключения','дюйм','1 1/2','1 1/2','1 1/2','1 1/2','2','2','2','2','2'],
              ['Диаметр дымохода','мм','159','159','220','220','220','220','220','220','220'],
              ['Масса котла','кг','326','367','450','460','555','589','623','663','669'],
              ['Объем топки','дм3','91','117','146','163','220','242','264','304','304'],
              ['Ширина*','см','59','59','69','69','74','74','74','74','74'],
              ['Глубина*','см','62','72','86','91','91','96','101','111','111'],
              ['Высота*','см','142','142','142','142','168','168','168','168','168']
            ]
          }
        },

        // {
        //   id: '',
        //   title: '',
        //   images: [
        //     '/img/belkomin/TIS_PRO_1.png',
        //   ],
        //   price: null,
        //   characteristics: [
        //     '',
        //   ],
        //   docs: [
        //     '',
        //   ],
        //   descriptions: [
        //     '',
        //   ],
        //   table: {
        //     head: [
        //       '',
        //     ],
        //     body: [
        //       [
        //         '',
        //       ],
        //     ]
        //   }
        // },

        // {
        //   id: '',
        //   title: '',
        //   images: [
        //     '/img/belkomin/TIS_PRO_1.png',
        //   ],
        //   price: null,
        //   characteristics: [
        //     '',
        //   ],
        //   docs: [
        //     '',
        //   ],
        //   descriptions: [
        //     '',
        //   ],
        //   table: {
        //     head: [
        //       '',
        //     ],
        //     body: [
        //       [
        //         '',
        //       ],
        //     ]
        //   }
        // },

        // {
        //   id: '',
        //   title: '',
        //   images: [
        //     '/img/belkomin/TIS_PRO_1.png',
        //   ],
        //   price: null,
        //   characteristics: [
        //     '',
        //   ],
        //   docs: [
        //     '',
        //   ],
        //   descriptions: [
        //     '',
        //   ],
        //   table: {
        //     head: [
        //       '',
        //     ],
        //     body: [
        //       [
        //         '',
        //       ],
        //     ]
        //   }
        // },

        // {
        //   id: '',
        //   title: '',
        //   images: [
        //     '/img/belkomin/TIS_PRO_1.png',
        //   ],
        //   price: null,
        //   characteristics: [
        //     '',
        //   ],
        //   docs: [
        //     '',
        //   ],
        //   descriptions: [
        //     '',
        //   ],
        //   table: {
        //     head: [
        //       '',
        //     ],
        //     body: [
        //       [
        //         '',
        //       ],
        //     ]
        //   }
        // },

      ]
    }),
    computed: {
      toolbar () {
        return this.lines.map( ({ id , title }) => ({ id , title }) );
      }
    },
    created () {
      this.$emit( 'set-toolbar' , this.toolbar );
    }
  };

</script>
