<template>
  <div class="main">

    <section class="intro">
      <h1 class="md-display-2">Твёрдотопливные котлы Buderus</h1>
      <p class="md-body-2">
        Котельная на твёрдом топливе может использоваться даже там, куда не подведены ни газопровод, ни линия электропередач, - твердотопливные котлы полностью автономны. Это преимущество твердотопливных отопительных котлов в сочетании с невысокой стоимостью котла, а также доступностью и дешевизной топлива, обусловливает их популярность в России
      </p>
    </section>

    <Buderus-Template
      v-for="line in lines" :key="line.id"
      :Line="line" />

    <nav class="families">
      <span class="families__list-title">Другие семейства твёрдотопливных котлов:</span>
      <ul class="families__list">
        <li><a href="kentatsu.html" class="families__link" ripple-light>Kentatsu Furst Vulkan</a></li>
        <li><a href="termokraft.html" class="families__link" ripple-light>Termokraft</a></li>
        <li><a href="zota.html" class="families__link" ripple-light>Zota</a></li>
        <li><a href="nmk.html" class="families__link" ripple-light>НМК</a></li>
        <li><a href="energy-tt.html" class="families__link" ripple-light>Энергия-ТТ</a></li>
      </ul>
    </nav>

  </div>
</template>

<script>

  import BuderusTemplate from './BuderusTemplate.vue';

  export default {
    name: 'Buderus',
    components: { BuderusTemplate },
    data: () => ({
      lines: [
        {
          id: 'S111-2',
          title: 'Buderus Logano S111-2',
          image: '/img/buderus/111.jpg',
          price: null,
          characteristics: [
            'Котел BUDERUS LOGANO S111-2 мощностью до 28 кВт – представитель обновленной линейки котлов Buderus Logano S111;',
            'Как и в предыдущей версии, котел разработан для простого, приятного и эффективного отопления, LOGANO S111-2 сжигает древесину, бурый и каменный уголь, кокс и прессованное сорта твердого топлива. 8 типоразмеров серии от 12 до 45 кВт позволяют выбрать наиболее подходящий вариант котла. Отличительная особенность серии S111-2 – усовершенствованный внешний вид котла;',
            'Теперь котел LOGANO S111-2 – это стильный и элегантный котел с модифицированной конструкцией для современного отопления;',
            'Конструктивные изменения котла коснулись некоторых других деталей оборудования: для удобства и быстрого монтажа фланцевые подключения заменены на резьбовые, усовершенствованы крепления изоляции и петель зольной дверцы котла. Узкие габаритные размеры котла позволяют использовать его в небольших помещениях под котельную.'
          ],
          docs: null,
          descriptions: [
            'Котёл Zota Box предназначен для отопления жилых помещений. Применяется в системах отопления с принудительной циркуляцией и представлен в варианте мощностью 8 кВт.'
          ],
          table: {
            head: [
              'Характеристики/Наименование',
              'Logano S111-2 12',
              'Logano S111-2 20',
              'Logano S111-2 24',
              'Logano S111-2 32',
            ],
            body: [
              [
                'Мощность, кВт',
                '13,5',
                '20',
                '24',
                '32',
              ],
              [
                'Отапливаемая площадь, м²',
                '135',
                '200',
                '240',
                '320'
              ],
              [
                'Объем топки, л',
                '26',
                '46',
                '46',
                '61'
              ],
              [
                'Объем теплоносителя, л',
                '46',
                '56',
                '57',
                '64'
              ],
              [
                'Минимальная температура теплоносителя, ˚С',
                '65',
                '65',
                '65',
                '65'
              ],
              [
                'Рабочая температура теплоносителя, ˚С',
                '95',
                '95',
                '95',
                '95'
              ],
              [
                'Рабочее давление, Бар',
                '2,5',
                '2,5',
                '2,5',
                '2,5'
              ],
              [
                'Диаметр соединения, мм',
                '50',
                '40',
                '40',
                '40'
              ],
              [
                'Диаметр дымохода, мм',
                '150',
                '150',
                '150',
                '150'
              ],
              [
                'Высота дымохода, м',
                '6',
                '10',
                '10',
                '10'
              ],
              [
                'Вид топлива',
                'дрова, уголь',
                'дрова, уголь',
                'дрова, уголь',
                'дрова, уголь'
              ],
              [
                'Высота, мм',
                '600',
                '990',
                '990',
                '990'
              ],
              [
                'Ширина, мм',
                '730',
                '700',
                '700',
                '700'
              ],
              [
                'Глубина, мм',
                '920',
                '770',
                '770',
                '870'
              ],
              [
                'Масса не более, кг',
                '158',
                '200,50',
                '215',
                '240'
              ],
              [
                'Цена, руб',
                '44 150',
                '54 290',
                '61 825',
                '64 895'
              ],
            ]
          }
        },
        {
          id: 'S131',
          title: 'Buderus Logano S131',
          images: [
            '/img/buderus/131-1.jpg',
            '/img/buderus/131-2.jpg',
            '/img/buderus/131-3.jpg'
          ],
          price: null,
          characteristics: [
            'Новая конструкция теплообменника;',
            'Улучшено качество и время горения благодаря увеличению объёма загрузочной камеры;',
            'Возможно установить внешний электрический ТЭН;',
            'Новый механизм управления растопочной заслонкой;',
            'Загрузка спереди позволяет производить чистку ограниченных узлов котла даже во время его работы;',
            'Изменена конструкция зольного ящика, он стал больше, его удобно вынимать и чистить;',
            'Изменение другие узлов также позволило облегчить работы по чистке котла;',
            'Дизайн колосниковых решеток был изменен с подвижных элементов на статические (легкое удаление и замена).',
          ],
          docs: null,
          descriptions: [
            'Котёл Zota Box предназначен для отопления жилых помещений. Применяется в системах отопления с принудительной циркуляцией и представлен в варианте мощностью 8 кВт.'
          ],
          table: {
            head: [
              'Характеристики/Наименование',
              'Logano S131-15 H',
              'Logano S131-22 H',
            ],
            body: [
              [
                'Мощность, кВт',
                '15',
                '22'
              ],
              [
                'Отапливаемая площадь, м²',
                '150',
                '220'
              ],
              [
                'Объем топки, л',
                '38',
                '60'
              ],
              [
                'Рабочая температура теплоносителя, ˚С',
                '90',
                '90'
              ],
              [
                'Рабочее давление, Бар',
                '2',
                '2'
              ],
              [
                'Диаметр дымохода, мм',
                '150',
                '150'
              ],
              [
                'Вид топлива',
                'дрова, уголь',
                'дрова, уголь'
              ],
              [
                'Высота, мм',
                '997',
                '966'
              ],
              [
                'Ширина, мм',
                '543',
                '536'
              ],
              [
                'Глубина, мм',
                '838',
                '838'
              ],
              [
                'Цена, руб',
                '48 190',
                '62 820'
              ]
            ]
          }
        }
      ]
    }),
    computed: {
      toolbar () {
        return this.lines.map( ({ id , title }) => ({ id , title }) );
      }
    },
    created () {
      this.$emit( 'set-toolbar' , this.toolbar );
    }
  };

</script>
