<template>
  <div class="main">

    <section class="product">
      <h1 class="md-display-2">Банные печи Везувий</h1>
      <p class="md-body-2">
        <!-- Котельная на твёрдом топливе может использоваться даже там, куда не подведены ни газопровод, ни линия электропередач, - твердотопливные котлы полностью автономны. Это преимущество твердотопливных отопительных котлов в сочетании с невысокой стоимостью котла, а также доступностью и дешевизной топлива, обусловливает их популярность в России -->
      </p>
    </section>

    <Vezuviy-Stove-Template
      v-for="line in lines"
      :key="line.id"
      :Line="line" />

  </div>
</template>

<script>

  import VezuviyStoveTemplate from './VezuviyStoveTemplate.vue';

  export default {
    name: 'Vezuviy-Stoves',

    components: { VezuviyStoveTemplate },

    data: () => ({
      lines: [

        {
          id: 'vezuviy__pechi-stalnye_optimum-01',
          title: 'ПЕЧЬ ОПТИМУМ СТАНДАРТ 14 (ДТ-3)',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_optimum/optimum-1-1.jpg',
            '/img/vezuviy__pechi-stalnye_optimum/optimum-1-2.jpg',
          ],
          price: {
            value: 9660,
            currency: 'rub',
          },
          characteristics: [
            'Топочная дверца ДТ-3',
            'Топится Из смежного помещения',
            'Высота, мм 580',
            'Ширина, мм 500',
            'Вес камней, кг 110',
            'Диаметр дымохода, мм 115',
            'Объем парильного помещения, м3 6-14',

          ],
          docs: [{
            title: 'Банные печи - инструкция по монтажу и эксплуатации',
            link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
          },
          {
            title: 'Евразийский экономический союз декларации о соответствии',
            link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
          },
          ],

          descriptions: [
            'Банная печь Оптимум идеально подходит для бань с парной не более 14 м3.',
            'Благодаря упрощённому строению топки и использованию в ней минимально допустимой толщину металла является самой бюджетной моделью в своём классе.',
            'Банная печь Оптимум  укомплектована топочной  чугунной дверцей и чугунным колосником.',
            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',
          ],
          table: {
            head: null,
            body: null,
          },
        },

        {
          id: 'vezuviy__pechi-stalnye_optimum-02',
          title: 'ПЕЧЬ ОПТИМУМ СТАНДАРТ 14 (ДТ-3) Б/В',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_optimum/optimum-2-1.jpg',
            '/img/vezuviy__pechi-stalnye_optimum/optimum-2-2.jpg',
          ],
          price: {
            value: 9660,
            currency: 'rub',
          },
          characteristics: [
            'Топочная дверца ДТ-3',
            'Топится Из парильного помещения',
            'Высота, мм 580',
            'Ширина, мм 500',
            'Вес камней, кг 110',
            'Диаметр дымохода, мм 115',
            'Объем парильного помещения, м3 6-14',
          ],
          docs: [
            {
              title: 'Банные печи - инструкция по монтажу и эксплуатации',
              link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
            },
            {
              title: 'Евразийский экономический союз декларации о соответствии',
              link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
            },
          ],
          descriptions: [
            'Банная печь Оптимум идеально подходит для бань с парной не более 14 м3.',
            'Благодаря упрощённому строению топки и использованию в ней минимально допустимой толщину металла является самой бюджетной моделью в своём классе.',
            'Банная печь Оптимум  укомплектована топочной  чугунной дверцей и чугунным колосником.',
            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',
          ],
          table: {
            head: null,
            body: null,
          },
        },

        {
          id: 'vezuviy__pechi-stalnye_skif-03',
          title: 'ПЕЧЬ СКИФ СТАНДАРТ 12 (ДТ-3)',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-1-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-1-2.jpg',
          ],
          price: {
            value: 2520,
            currency: 'rub',
          },
          characteristics: [
            'Топочная дверца ДТ-3',
            'Топится Из смежного помещения',
            'Высота, мм 580',
            'Ширина, мм 520',
            'Глубина, мм 710',
            'Вес камней, кг 110',
            'Диаметр дымохода, мм 115',
            'Длина топочного тоннеля, мм 250',
            'Объем парильного помещения, м3 6-14',
            'Вес, кг 63',
          ],
          docs: [
            {
              title: 'Банные печи - инструкция по монтажу и эксплуатации',
              link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
            },
            {
              title: 'Евразийский экономический союз декларации о соответствии',
              link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
            },
          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 110кг камней;',
            '6. Срок службы  10 лет.',
            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',
          ],
          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],
            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },
        },

        {
          id: 'vezuviy__pechi-stalnye_skif-04',
          title: 'ПЕЧЬ СКИФ СТАНДАРТ 12 (ДТ-3) Б/В',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-2-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-2-2.jpg',
          ],
          price: {
            value: 12520,
            currency: 'rub',
          },
          characteristics: [
            'Топочная дверца ДТ-3',
            'Топится Из парильного помещения',
            'Высота, мм 580',
            'Ширина, мм 520',
            'Глубина, мм 500',
            'Вес камней, кг 110',
            'Диаметр дымохода, мм 115',
            'Объем парильного помещения, м3 6-14',
          ],
          docs: [
            {
              title: 'Банные печи - инструкция по монтажу и эксплуатации',
              link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
            },
            {
              title: 'Евразийский экономический союз декларации о соответствии',
              link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
            },
          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 110кг камней;',
            '6. Срок службы  10 лет.',

            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',

          ],

          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],
            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },
        },

        {
          id: 'vezuviy__pechi-stalnye_skif-05',
          title: 'ПЕЧЬ СКИФ СТАНДАРТ 12 (ДТ-3С)',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-3-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-1-2.jpg',
          ],
          price: {
            value: 13890,
            currency: 'rub',
          },
          characteristics: [
            'Топочная дверца ДТ-3С',
            'Топится Из смежного помещения',
            'Высота, мм 580',
            'Ширина, мм 520',
            'Глубина, мм 710',
            'Вес камней, кг 110',
            'Диаметр дымохода, мм 115',
            'Длина топочного тоннеля, мм 250',
            'Объем парильного помещения, м3 6-14',
            'Вес, кг 62',
          ],
          docs: [
            {
              title: 'Банные печи - инструкция по монтажу и эксплуатации',
              link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
            },
            {
              title: 'Евразийский экономический союз декларации о соответствии',
              link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
            },
          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 110кг камней;',
            '6. Срок службы  10 лет.',
            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',
          ],
          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],
            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },
        },

        {
          id: 'vezuviy__pechi-stalnye_skif-06',
          title: 'ПЕЧЬ СКИФ СТАНДАРТ 12 (ДТ-3С) Б/В',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-4-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-2-2.jpg',
          ],
          price: {
            value: 13890,
            currency: 'rub',
          },
          characteristics: [
            'Топочная дверца ДТ-3С',
            'Топится Из парильного помещения',
            'Высота, мм 580',
            'Ширина, мм 520',
            'Глубина, мм 500',
            'Вес камней, кг 110',
            'Диаметр дымохода, мм 115',
            'Объем парильного помещения, м3 6-14',
          ],
          docs: [
            {
              title: 'Банные печи - инструкция по монтажу и эксплуатации',
              link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
            },
            {
              title: 'Евразийский экономический союз декларации о соответствии',
              link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
            },
          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 110кг камней;',
            '6. Срок службы  10 лет.',
            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',
          ],
          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],
            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },
        },

        {
          id: 'vezuviy__pechi-stalnye_skif-07',
          title: 'ПЕЧЬ СКИФ СТАНДАРТ 16 (ДТ-4)',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-1-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-1-3.jpg',
          ],
          price: {
            value: 14720,
            currency: 'rub',
          },
          characteristics: [
            'Топочная дверца ДТ-4',
            'Топится Из смежного помещения',
            'Высота, мм 640',
            'Ширина, мм 520',
            'Глубина, мм 710',
            'Вес камней, кг 130',
            'Диаметр дымохода, мм 115',
            'Длина топочного тоннеля, мм 250',
            'Объем парильного помещения, м3 8-18',
            'Вес, кг 66',
          ],
          docs: [
            {
              title: 'Банные печи - инструкция по монтажу и эксплуатации',
              link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
            },
            {
              title: 'Евразийский экономический союз декларации о соответствии',
              link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
            },
          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;',
            '6. Срок службы  10 лет.',

            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',

          ],
          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],
            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },
        },

        {
          id: 'vezuviy__pechi-stalnye_skif-08',
          title: 'ПЕЧЬ СКИФ СТАНДАРТ 16 (ДТ-4) Б/В',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-2-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-2-3.jpg',
          ],
          price: {
            value: 14720,
            currency: 'rub',
          },
          characteristics: [
            'Топочная дверца ДТ-4',
            'Топится Из парильного помещения',
            'Высота, мм 640',
            'Ширина, мм 520',
            'Глубина, мм 500',
            'Вес камней, кг 130',
            'Диаметр дымохода, мм 115',
            'Объем парильного помещения, м3 8-18',
          ],
          docs: [
            {
              title: 'Банные печи - инструкция по монтажу и эксплуатации',
              link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
            },
            {
              title: 'Евразийский экономический союз декларации о соответствии',
              link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
            },
          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;',
            '6. Срок службы  10 лет.',
            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',
          ],
          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],
            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },


        },

        {
          id: 'vezuviy__pechi-stalnye_skif-09',
          title: 'ПЕЧЬ СКИФ СТАНДАРТ 22 (ДТ-4) Б/В',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-2-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-2-4.jpg',

          ],
          price: {
            value: 16720,
            currency: 'rub',
          },

          characteristics: [
            'Топочная дверца ДТ-4',
            'Топится Из парильного помещения',
            'Высота, мм 740',
            'Ширина, мм 520',
            'Глубина, мм 500',
            'Вес камней, кг 150',
            'Диаметр дымохода, мм 115',
            'Объем парильного помещения, м3 12-24',
          ],
          docs: [{
            title: 'Банные печи - инструкция по монтажу и эксплуатации',
            link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
          },
          {
            title: 'Евразийский экономический союз декларации о соответствии',
            link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
          },

          ],

          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;', // 150?
            '6. Срок службы  10 лет.',

            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',

          ],

          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],

            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },

        },

        {
          id: 'vezuviy__pechi-stalnye_skif-10',
          title: 'ПЕЧЬ СКИФ СТАНДАРТ 16 (ДТ-4С)',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-3-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-1-3.jpg',

          ],
          price: {
            value: 17100,
            currency: 'rub',
          },

          characteristics: [
            'Топочная дверца ДТ-4С',
            'Топится Из смежного помещения',
            'Высота, мм 640',
            'Ширина, мм 520',
            'Глубина, мм 710',
            'Вес камней, кг 130',
            'Диаметр дымохода, мм 115',
            'Длина топочного тоннеля, мм 250',
            'Объем парильного помещения, м3 8-18',
            'Вес, кг 65',
          ],
          docs: [{
            title: 'Банные печи - инструкция по монтажу и эксплуатации',
            link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
          },
          {
            title: 'Евразийский экономический союз декларации о соответствии',
            link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
          },

          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;',
            '6. Срок службы  10 лет.',

            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',

          ],

          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],

            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },

        },

        {
          id: 'vezuviy__pechi-stalnye_skif-11',
          title: 'ПЕЧЬ СКИФ СТАНДАРТ 16 (ДТ-4С) Б/В',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-4-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-2-3.jpg',

          ],
          price: {
            value: 17100,
            currency: 'rub',
          },

          characteristics: [
            'Топочная дверца ДТ-4С',
            'Топится Из парильного помещения',
            'Высота, мм 640',
            'Ширина, мм 520',
            'Глубина, мм 500',
            'Вес камней, кг 130',
            'Диаметр дымохода, мм 115',
            'Длина топочного тоннеля, мм 250',
            'Объем парильного помещения, м3 8-18',
            'Вес, кг 65',
          ],
          docs: [{
            title: 'Банные печи - инструкция по монтажу и эксплуатации',
            link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
          },
          {
            title: 'Евразийский экономический союз декларации о соответствии',
            link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
          },

          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;',
            '6. Срок службы  10 лет.',

            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',

          ],

          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],

            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },

        },

        {
          id: 'vezuviy__pechi-stalnye_skif-12',
          title: 'ПЕЧЬ СКИФ СТАНДАРТ 16 (ДТ-4) С Т/О',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-1-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-1-4.jpg',

          ],
          price: {
            value: 17340,
            currency: 'rub',
          },

          characteristics: [
            'Топочная дверца ДТ-4',
            'Топится Из смежного помещения',
            'Высота, мм 640',
            'Ширина, мм 520',
            'Глубина, мм 710',
            'Вес камней, кг 130',
            'Диаметр дымохода, мм 115',
            'Длина топочного тоннеля, мм 250',
            'Объем парильного помещения, м3 8-18',
            'Вес, кг 66',
          ],
          docs: [{
            title: 'Банные печи - инструкция по монтажу и эксплуатации',
            link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
          },
          {
            title: 'Евразийский экономический союз декларации о соответствии',
            link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
          },

          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;',
            '6. Срок службы  10 лет.',

            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',

          ],

          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],

            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },

        },

        {
          id: 'vezuviy__pechi-stalnye_skif-13',
          title: 'ПЕЧЬ СКИФ СТАНДАРТ 22 (ДТ-4)',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-1-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-1-5.jpg',

          ],
          price: {
            value: 16720,
            currency: 'rub'
          },
          characteristics: [
            'Топочная дверца ДТ-4',
            'Топится Из смежного помещения',
            'Высота, мм 740',
            'Ширина, мм 520',
            'Глубина, мм 710',
            'Вес камней, кг 150',
            'Диаметр дымохода, мм 115',
            'Длина топочного тоннеля, мм 250',
            'Объем парильного помещения, м3 8-18',
            'Вес, кг 70'
          ],
          docs: [
            {
              title: 'Банные печи - инструкция по монтажу и эксплуатации',
              link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
            },
            {
              title: 'Евразийский экономический союз декларации о соответствии',
              link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
            },
          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;',
            '6. Срок службы  10 лет.',
            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',
          ],
          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],
            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },
        },

        {
          id: 'vezuviy__pechi-stalnye_skif-14',
          title: 'ПЕЧЬ СКИФ СТАНДАРТ 28 ДТ-4',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-1-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-1-6.jpg',

          ],
          price: {
            value: 18680,
            currency: 'rub',
          },

          characteristics: [
            'Топочная дверца ДТ-4',
            'Топится Из смежного помещения',
            'Высота, мм 780',
            'Ширина, мм 520',
            'Глубина, мм 710',
            'Диаметр дымохода, мм 115',
            'Длина топочного тоннеля, мм 250',
            'Объем парильного помещения, м3 14-30',
          ],
          docs: [{
            title: 'Банные печи - инструкция по монтажу и эксплуатации',
            link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
          },
          {
            title: 'Евразийский экономический союз декларации о соответствии',
            link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
          },

          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;', //150?
            '6. Срок службы  10 лет.',

            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',

          ],

          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],

            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },

        },

        {
          id: 'vezuviy__pechi-stalnye_skif-15',
          title: 'ПЕЧЬ СКИФ СТАНДАРТ 22 (ДТ-4С)',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-3-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-1-5.jpg',

          ],
          price: {
            value: 19100,
            currency: 'rub',
          },

          characteristics: [
            'Топочная дверца ДТ-4',
            'Топится Из смежного помещения',
            'Высота, мм 740',
            'Ширина, мм 520',
            'Глубина, мм 710',
            'Диаметр дымохода, мм 115',
            'Длина топочного тоннеля, мм 250',
            'Объем парильного помещения, м3 12-24',
            'Диаметр трубы 115',
            'Вес, кг 69',

          ],
          docs: [{
            title: 'Банные печи - инструкция по монтажу и эксплуатации',
            link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
          },
          {
            title: 'Евразийский экономический союз декларации о соответствии',
            link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
          },

          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;',
            '6. Срок службы  10 лет.',

            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',

          ],

          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],

            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },

        },

        {
          id: 'vezuviy__pechi-stalnye_skif-16',
          title: 'ПЕЧЬ СКИФ СТАНДАРТ 22 (ДТ-4С) Б/В',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-4-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-2-4.jpg',
            '/img/vezuviy__pechi-stalnye_skif/deklaraciya.jpg',
          ],
          price: {
            value: 19100,
            currency: 'rub',
          },

          characteristics: [
            'Топочная дверца ДТ-4 стекло',
            'Топится Из парной',
            'Высота, мм 740',
            'Ширина, мм 520',
            'Глубина, мм 500',
            'Вес камней, кг 150',
            'Диаметр дымохода, мм 115',

          ],
          docs: [{
            title: 'Банные печи - инструкция по монтажу и эксплуатации',
            link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
          },
          {
            title: 'Евразийский экономический союз декларации о соответствии',
            link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
          },

          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;', //150?
            '6. Срок службы  10 лет.',

            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',

          ],

          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],

            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },

        },

        {
          id: 'vezuviy__pechi-stalnye_skif-17',
          title: 'ПЕЧЬ СКИФ СТАНДАРТ 22 (ДТ-4) Т/О',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-1-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-1-7.jpg',
          ],
          price: {
            value: 19300,
            currency: 'rub',
          },

          characteristics: [
            'Топочная дверца ДТ-4',
            'Топится Из смежного помещения',
            'Высота, мм 740',
            'Ширина, мм 520',
            'Глубина, мм 710',
            'Вес камней, кг 150',
            'Диаметр дымохода, мм 115',
            'Длина топочного тоннеля, мм 250',
            'Объем парильного помещения, м3 12-24',
            'Вес, кг 70',

          ],
          docs: [{
            title: 'Банные печи - инструкция по монтажу и эксплуатации',
            link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
          },
          {
            title: 'Евразийский экономический союз декларации о соответствии',
            link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
          },

          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;', //150?
            '6. Срок службы  10 лет.',

            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',

          ],

          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],

            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },

        },

        {
          id: 'vezuviy__pechi-stalnye_skif-18',
          title: 'ПЕЧЬ СКИФ СТАНДАРТ 16 (ДТ-4С) С Т/О',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-3-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-3-2.jpg',
          ],
          price: {
            value: 19720,
            currency: 'rub',
          },

          characteristics: [
            'Топочная дверца ДТ-4С',
            'Топится Из смежного помещения',
            'Высота, мм 640',
            'Ширина, мм 520',
            'Глубина, мм 710',
            'Вес камней, кг 130',
            'Диаметр дымохода, мм 115',
            'Длина топочного тоннеля, мм 250',
            'Объем парильного помещения, м3 8-18',
            'Вес, кг 70	',

          ],
          docs: [{
            title: 'Банные печи - инструкция по монтажу и эксплуатации',
            link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
          },
          {
            title: 'Евразийский экономический союз декларации о соответствии',
            link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
          },

          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;',
            '6. Срок службы  10 лет.',

            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',

          ],

          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],

            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },

        },

        {
          id: 'vezuviy__pechi-stalnye_skif-19',
          title: 'ПЕЧЬ СКИФ СТАНДАРТ 28 ДТ-4С',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-3-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-3-3.jpg',
          ],
          price: {
            value: 21060,
            currency: 'rub',
          },
          characteristics: [
            'Топочная дверца ДТ-4С',
            'Топится Из смежного помещения',
            'Высота, мм 780',
            'Ширина, мм 520',
            'Глубина, мм 710',
            'Диаметр дымохода, мм 115',
            'Длина топочного тоннеля, мм 250',
            'Объем парильного помещения, м3 14-30',
          ],
          docs: [
            {
              title: 'Банные печи - инструкция по монтажу и эксплуатации',
              link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
            },
            {
              title: 'Евразийский экономический союз декларации о соответствии',
              link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
            },
          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;',
            '6. Срок службы  10 лет.',
            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',
          ],
          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],
            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },
        },

        {
          id: 'vezuviy__pechi-stalnye_skif-20',
          title: 'ПЕЧЬ СКИФ СТАНДАРТ 22 (ДТ-4С) Т/О',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-3-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-3-4.jpg',
          ],
          price: {
            value: 21700,
            currency: 'rub',
          },
          characteristics: [
            'Топочная дверца ДТ-4 стекло',
            'Топится Из смежного помещения',
            'Высота, мм 740',
            'Ширина, мм 520',
            'Глубина, мм 710',
            'Вес камней, кг 150',
            'Длина топочного тоннеля, мм 250',
            'Объем парильного помещения, м3 12-24',
            'Диаметр трубы 115',
            'Вес, кг 74',
          ],
          docs: [
            {
              title: 'Банные печи - инструкция по монтажу и эксплуатации',
              link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
            },
            {
              title: 'Евразийский экономический союз декларации о соответствии',
              link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
            },
          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;', //150?
            '6. Срок службы  10 лет.',
            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',
          ],
          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],
            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },
        },

        {
          id: 'vezuviy__pechi-stalnye_skif-21',
          title: 'ПЕЧЬ СКИФ С ЗАКРЫТОЙ КАМЕНКОЙ (ДТ-4)',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-5-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-5-2.jpg',
          ],
          price: {
            value: 19190,
            currency: 'rub',
          },
          characteristics: [
            'Топочная дверца ДТ-4',
            'Топится Из смежного помещения',
            'Высота, мм 740',
            'Ширина, мм 520',
            'Глубина, мм 710',
            'Вес камней, кг 150',
            'Диаметр дымохода, мм 115',
            'Длина топочного тоннеля, мм 250',
            'Объем парильного помещения, м3 12-24',
            'Вес, кг 111',
          ],
          docs: [
            {
              title: 'Банные печи - инструкция по монтажу и эксплуатации',
              link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
            },
            {
              title: 'Евразийский экономический союз декларации о соответствии',
              link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
            },

          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;', //150?
            '6. Срок службы  10 лет.',
            'Данная печь одинаково адаптирована для использования в финской сауне и русской бане Уникальность печи заключается в установке в верхней части печи закрытой каменки, камни в ней нагреваются до 400°С, что позволяет достичь мелкий дисперсионный пар. Топка изготовлена из специальной конструкционной стали, толщина топки в местах наиболее подверженные температурному воздействию достигает 12 мм.',
            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',
          ],
          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],
            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },
        },

        {
          id: 'vezuviy__pechi-stalnye_skif-22',
          title: 'ПЕЧЬ СКИФ КОВКА 16 (220)',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-6-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-6-2.jpg',
          ],
          price: {
            value: 21760,
            currency: 'rub',
          },
          characteristics: [
            'Топочная дверца Везувий 220',
            'Топится Из смежного помещения',
            'Высота, мм 640',
            'Ширина, мм 520',
            'Глубина, мм 710',
            'Вес камней, кг 130',
            'Диаметр дымохода, мм 115',
            'Длина топочного тоннеля, мм 250',
            'Объем парильного помещения, м3 8-18',
            'Вес, кг 80',
          ],
          docs: [
            {
              title: 'Банные печи - инструкция по монтажу и эксплуатации',
              link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
            },
            {
              title: 'Евразийский экономический союз декларации о соответствии',
              link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
            },
          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;',
            '6. Срок службы  10 лет.',
            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',
          ],
          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],
            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },
        },

        {
          id: 'vezuviy__pechi-stalnye_skif-23',
          title: 'ПЕЧЬ СКИФ КОВКА 22 (220)',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-6-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-6-3.jpg',
          ],
          price: {
            value: 23520,
            currency: 'rub',
          },
          characteristics: [
            'Топочная дверца Везувий 220',
            'Топится Из смежного помещения',
            'Высота, мм 740',
            'Ширина, мм 520',
            'Глубина, мм 710',
            'Диаметр дымохода, мм 115',
            'Длина топочного тоннеля, мм 250',
            'Объем парильного помещения, м3 12-24',
          ],
          docs: [
            {
              title: 'Банные печи - инструкция по монтажу и эксплуатации',
              link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
            },
            {
              title: 'Евразийский экономический союз декларации о соответствии',
              link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
            },

          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;',
            '6. Срок службы  10 лет.',
            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',
          ],
          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],
            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },
        },

        {
          id: 'vezuviy__pechi-stalnye_skif-24',
          title: 'ПЕЧЬ СКИФ КОВКА 16 ПАНОРАМА',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-7-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-7-2.jpg',
          ],
          price: {
            value: 23730,
            currency: 'rub',
          },
          characteristics: [
            'Топочная дверца Панорама',
            'Топится Из смежного помещения',
            'Высота, мм 640',
            'Ширина, мм 520',
            'Глубина, мм 710',
            'Вес камней, кг 130',
            'Диаметр дымохода, мм 115',
            'Длина топочного тоннеля, мм 250',
            'Объем парильного помещения, м3 8-18',
            'Вес, кг 96',
          ],
          docs: [
            {
              title: 'Банные печи - инструкция по монтажу и эксплуатации',
              link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
            },
            {
              title: 'Евразийский экономический союз декларации о соответствии',
              link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
            },

          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;',
            '6. Срок службы  10 лет.',
            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',
          ],
          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],
            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },
        },

        {
          id: 'vezuviy__pechi-stalnye_skif-25',
          title: 'ПЕЧЬ СКИФ КОВКА 22 ПАНОРАМА',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-7-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-7-3.jpg',
          ],
          price: {
            value: 24240,
            currency: 'rub',
          },
          characteristics: [
            'Топочная дверца Панорама',
            'Топится Из смежного помещения',
            'Высота, мм 740',
            'Ширина, мм 520',
            'Глубина, мм 710',
            'Вес камней, кг 150',
            'Диаметр дымохода, мм 115',
            'Объем парильного помещения, м3 12-24',
          ],
          docs: [
            {
              title: 'Банные печи - инструкция по монтажу и эксплуатации',
              link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
            },
            {
              title: 'Евразийский экономический союз декларации о соответствии',
              link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
            },
          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;', //150?
            '6. Срок службы  10 лет.',
            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',
          ],
          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],
            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },
        },

        {
          id: 'vezuviy__pechi-stalnye_skif-26',
          title: 'ПЕЧЬ СКИФ С ЗАКРЫТОЙ КАМЕНКОЙ (270)',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-8-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-8-2.jpg',
          ],
          price: {
            value: 25040,
            currency: 'rub',
          },

          characteristics: [
            'Топочная дверца Везувий 270 со стеклом',
            'Топится Из смежного помещения',
            'Высота, мм 740',
            'Ширина, мм 520',
            'Глубина, мм 710',
            'Вес камней, кг 150',
            'Диаметр дымохода, мм 115',
            'Длина топочного тоннеля, мм 250',
            'Объем парильного помещения, м3 12-24',
            'Вес, кг 91',

          ],
          docs: [{
            title: 'Банные печи - инструкция по монтажу и эксплуатации',
            link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
          },
          {
            title: 'Евразийский экономический союз декларации о соответствии',
            link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
          },

          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;', //150?
            '6. Срок службы  10 лет.',

            'Данная печь одинаково адаптирована для использования в финской сауне и русской бане Уникальность печи заключается в установке в верхней части печи закрытой каменки, камни в ней нагреваются до 400°С, что позволяет достичь мелкий дисперсионный пар. Топка изготовлена из специальной конструкционной стали, толщина топки в местах наиболее подверженные температурному воздействию достигает 12 мм.',

            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',
          ],

          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],

            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },

        },

        {
          id: 'vezuviy__pechi-stalnye_skif-27',
          title: 'ПЕЧЬ СКИФ КОВКА 28 ПАНОРАМА',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-7-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-7-4.jpg',
          ],
          price: {
            value: 26310,
            currency: 'rub',
          },

          characteristics: [
            'Топочная дверца Панорама',
            'Топится Из смежного помещения',
            'Высота, мм 780',
            'Ширина, мм 520',
            'Глубина, мм 710',
            'Диаметр дымохода, мм 115',
            'Длина топочного тоннеля, мм 250',
            'Объем парильного помещения, м3 14-30',

          ],
          docs: [{
            title: 'Банные печи - инструкция по монтажу и эксплуатации',
            link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
          },
          {
            title: 'Евразийский экономический союз декларации о соответствии',
            link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
          },

          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;',
            '6. Срок службы  10 лет.',

            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',
          ],

          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],

            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },

        },

        {
          id: 'vezuviy__pechi-stalnye_skif-28',
          title: 'ПЕЧЬ СКИФ КОВКА 16 (205)',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-9-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-9-2.jpg',
          ],
          price: {
            value: 28500,
            currency: 'rub',
          },

          characteristics: [
            'Топочная дверца Везувий 205',
            'Топится Из смежного помещения',
            'Высота, мм 640',
            'Ширина, мм 520',
            'Глубина, мм 710',
            'Вес камней, кг 130',
            'Диаметр дымохода, мм 115',
            'Длина топочного тоннеля, мм 250',
            'Объем парильного помещения, м3 8-18',
            'Вес, кг 90',

          ],
          docs: [{
            title: 'Банные печи - инструкция по монтажу и эксплуатации',
            link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
          },
          {
            title: 'Евразийский экономический союз декларации о соответствии',
            link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
          },

          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;',
            '6. Срок службы  10 лет.',

            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',
          ],

          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],

            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },

        },

        {
          id: 'vezuviy__pechi-stalnye_skif-29',
          title: 'ПЕЧЬ СКИФ КОВКА 22 (205)',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-9-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-9-3.jpg',
          ],
          price: {
            value: 30110,
            currency: 'rub',
          },

          characteristics: [
            'Топочная дверца Везувий 205',
            'Топится Из смежного помещения',
            'Высота, мм 740',
            'Ширина, мм 520',
            'Глубина, мм 710',
            'Объем парильного помещения, м3 12-24',

          ],
          docs: [{
            title: 'Банные печи - инструкция по монтажу и эксплуатации',
            link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
          },
          {
            title: 'Евразийский экономический союз декларации о соответствии',
            link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
          },

          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;',
            '6. Срок службы  10 лет.',

            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',
          ],

          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],

            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },
        },

        {
          id: 'vezuviy__pechi-stalnye_skif-30',
          title: 'ПЕЧЬ СКИФ СТАНДАРТ 38 (ДТК-2)',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-10-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-10-2.jpg',
          ],
          price: {
            value: 33850,
            currency: 'rub',
          },

          characteristics: [
            'Топочная дверца ДТК',
            'Топится Из смежного помещения',
            'Высота, мм 1000',
            'Ширина, мм 800',
            'Глубина, мм 1090',
            'Вес камней, кг 230',
            'Диаметр дымохода, мм 150',
            'Длина топочного тоннеля, мм 250',
            'Объем парильного помещения, м3 24-40',
            'Вес, кг 145',

          ],
          docs: [{
            title: 'Банные печи - инструкция по монтажу и эксплуатации',
            link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
          },
          {
            title: 'Евразийский экономический союз декларации о соответствии',
            link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
          },

          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;', //230?
            '6. Срок службы  10 лет.',

            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',
          ],

          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],

            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },
        },

        {
          id: 'vezuviy__pechi-stalnye_skif-31',
          title: 'ПЕЧЬ СКИФ КОВКА 28 (205)',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-9-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-9-4.jpg',
          ],
          price: {
            value: 31740,
            currency: 'rub',
          },

          characteristics: [
            'Топочная дверца Везувий 205',
            'Топится Из смежного помещения',
            'Высота, мм 780',
            'Ширина, мм 520',
            'Глубина, мм 710',
            'Диаметр дымохода, мм 115',
            'Длина топочного тоннеля, мм 250',
            'Объем парильного помещения, м3 14-30',

          ],
          docs: [{
            title: 'Банные печи - инструкция по монтажу и эксплуатации',
            link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
          },
          {
            title: 'Евразийский экономический союз декларации о соответствии',
            link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
          },

          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;',
            '6. Срок службы  10 лет.',

            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',
          ],

          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],

            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },
        },

        {
          id: 'vezuviy__pechi-stalnye_skif-32',
          title: 'ПЕЧЬ СКИФ КОВКА 38 (205) 2016',
          image: null,
          images: [
            '/img/vezuviy__pechi-stalnye_skif/skif-11-1.jpg',
            '/img/vezuviy__pechi-stalnye_skif/skif-11-2.jpg',
          ],
          price: {
            value: 51020,
            currency: 'rub',
          },

          characteristics: [
            'Топочная дверца Везувий 205',
            'Топится Из смежного помещения',
            'Высота, мм 1000',
            'Ширина, мм 800',
            'Глубина, мм 1090',
            'Вес камней, кг 230',
            'Диаметр дымохода, мм 150',
            'Длина топочного тоннеля, мм 250',

          ],
          docs: [{
            title: 'Банные печи - инструкция по монтажу и эксплуатации',
            link: 'http://vezuviy.su/upload/medialibrary/ee9/20181018.pdf',
          },
          {
            title: 'Евразийский экономический союз декларации о соответствии',
            link: 'http://vezuviy.su/upload/medialibrary/d70/d70408f3e5197e62ac432b01f2cc083e.pdf',
          },

          ],
          descriptions: [
            'Преимущество печи Скиф:',
            '1. Конструкционная сталь 6-8мм;',
            '2. Чугунный зуб отбойник;',
            '3. Чугунная топочная дверь;',
            '4. Чугунная колосниковая решётка;',
            '5. Конвекционно-вентилируемый кожух «СЕТКА» вмещающий до 130кг камней;', //230?
            '6. Срок службы  10 лет.',

            'Внешний вид товара может незначительно отличаться от фотографий на сайте.',
          ],

          table: {
            head: [
              'Тип помещения',
              'Температура ,°С',
              'Влажность, %',
              'Время, t (min)',
            ],

            body: [
              [
                'Финская сауна (сухая баня)',
                '90-110',
                '5-15',
                '80',
              ],
              [
                'Русская баня горячая (влажная сауна)',
                '70-90',
                '20-35',
                '60',
              ],
              [
                'Русская баня классическая (паровая сауна)',
                '45-65',
                '40-65',
                '50',
              ],
              [
                'Турецкая баня (паровая баня)',
                '40-45',
                'около 100',
                '40',
              ],
            ],
          },
        },

      ],
    }),

    computed: {
      toolbar () {
        return this.lines.map( ({ id , title }) => ({
          id,
          title: title.includes('Банная печь') ? title.slice(12) : title
        }));
      },
    },

    created () {
      this.$emit( 'set-toolbar' , this.toolbar );
    }

  };

</script>
